b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"37157943":{"pageid":37157943,"ns":0,"title":"Alpha (Marvel Comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{for|other uses of \\"Alpha\\" in comics|Alpha (comics)}}\\n{{Superherobox| <!--Wikipedia:WikiProject Comics-->\\n|image=[[File: Alpha-Marvel.jpg|250px]]\\n| caption = Cover of \'\'Alpha: Big Time\'\'  #1, textless variant.<br />Art by [[Humberto Ramos]].\\n| comic_color = background:#ff8080\\n| character_name = Alpha\\n| publisher = [[Marvel Comics]]\\n| debut = \'\'[[The Amazing Spider-Man]]\'\' #692 (August [[2012 in comics|2012]])\\n| creators = [[Dan Slott]]<br /> [[Humberto Ramos]]\\n| real_name = Andrew Maguire\\n| alliances =\\n| species = Human \\n| aliases = Andy Maguire, \\"Speedball\\", \\"Nova\\"\\n| powers =\\n* Exposure to Parker Particles, able to protract energy blasts, super strength, super speed, telekinesis, superhuman senses, matter manipulation, force fields, and flight\\n}}\\n\'\'\'Alpha\'\'\' (\'\'\'Andrew \\"Andy\\" Maguire\'\'\') is a fictional character in [[Marvel Comics]] who first appeared in \'\'[[The Amazing Spider-Man]]\'\'.<ref name=\\"ASM692\\">\'\'The Amazing Spider-Man\'\' #692 (August 2012)</ref>\\n\\n==Fictional character biography==\\nAndy Maguire was a student at Midtown High, the same school [[Peter Parker]] attended, but unlike Parker, he was not a good student, he was completely ignored by everyone and his parents did not care about his school work and neglected him.\\n\\nOne day during a demonstration at Horizon Labs, a problem arises during Parker\'s demonstration of \\"Parker Particles\\". Despite the attempts of Peter Parker and others to protect the class, Andy is forced to save a girl named Chrissy in the ensuing chaos, causing him to be struck by the energy himself. Instead of being fatally injured, he miraculously survived and Andrew gained the ability to create a hyper-kinetic form of energy tied to the forces of the universe. After being tested by many scientists superheroes, Andy became the new spokesman to Horizon Labs, while he was trained by Peter Parker\'s superheroic alter-ego, Spider-Man.<ref name=\\"ASM692\\"/>\\n\\nThe following days, Andy continued his super heroic career with the help of Spider-Man, although having a bad reception by the citizens. After observing Alpha, [[Jackal (Marvel Comics)|the Jackal]] kidnapped the boy along with his parents, in order to create clones of him and build an army to control the world. Spider-Man managed to track Andy to the villain\'s lair, where they learned Andy\'s DNA was not affected by the accident, leading his newly formed clones to be powerless. After failing to absorb Alpha\'s power, the Jackal escaped. In the aftermath, he emancipated from his parents.<ref>\'\'The Amazing Spider-Man\'\' #693 (September 2012)</ref>\\n\\nAfter he was called by Spider-Man to help the [[Avengers (comics)|Avengers]] to battle [[Terminus (comics)|Terminus]], Alpha used his powers without care, provoking many aircraft to shut down, risking the lives of the passengers and people in the ground. After the Avengers managed to rescue everybody, and Spider-Man his [[Aunt May]] and her husband Jay Jameson from Jameson\'s malfunctioning private jet, Peter decided that Alpha was too irresponsible to wield the powers he had. He used Terminus\' energy lance to deflect Alpha\'s energy to build an engine which took a huge portion of Andy\'s power. Spider-Man tells Andy that he will return to his parents and he will be attending high school once more. His powers are still growing, and maybe, he can be a hero again, just not as Alpha.<ref>\'\'The Amazing Spider-Man\'\' #694 (September 2012)</ref>\\n\\nSix months after these events took place, Andy\'s parents divorced and Andy, along with his mother, moved in with Andy\'s grandmother. Later, the [[The Superior Spider-Man|Superior Spider-Man]] ([[Doctor Octopus]]\' mind in Peter Parker\'s body) returned 10% of Alpha\'s abilities back to him in order to harness Parker Particles to make himself more powerful. Alpha then attempted to save a woman from a mugger, but accidentally crushed the man\'s skull. After admitting the mugger to the Pittsburgh University Medical Center, Alpha destroys an elemental parasite, preventing it from demolishing a steel plant. He then, after saving his friend Susan \\"Soupcan\\" Rice from a restaurant fire, realizes the Parker Particles have enhanced his senses to the point that he can hear and see everything on Earth. He then visits the mugger, who awakes and vows revenge, later mutating into a tumor-like beast named Zeta. After defeating an ex-Stark International engineer named The Miller with Thor\'s assistance, he attempts to remove the rampaging Zeta from the hospital, but is alerted that his mother\'s home is burning down, at the behest of \\"Boss\\" Cohen, Pittsburgh\'s top crime boss. After saving his mother, he enlists Spider-Man to help destroy Zeta, but fails to completely destroy all the cancerous tissue, allowing Zeta to escape. Then, after an attempt on Soupcan\'s life by one of Cohen\'s hitmen, Alpha threatens to kill Cohen, but is deterred by the fact that Cohen knows about the mugger. He then tells Alpha to not prevent any of Cohen\'s crime, or he\'ll release the information to the media. Andy then reveals his identity to his only other friend Duncan Kilgore and attempts to make a name for himself as protector of Pittsburgh.\\n\\n==Powers and abilities==\\nDue to his exposure to the Parker Particles, Andy is now capable of continually recharging massive amounts of cosmic energy, which he can release in the form of energy blasts, super strength, super speed, force fields, telekinesis, matter manipulation, and flight. So far, however, he\'s only able to manifest one of his abilities at a time instead of all at once. The Superior Spider-Man noted that it is possible that Alpha is the only being capable of utilizing Parker Particles without turning into a parasitic monster, or \\"Zeta\\".\\n\\n==Notes==\\n* Andy\'s name is a reference to [[Andrew Garfield]] and [[Tobey Maguire]], who have both portrayed Spider-Man in the [[Spider-Man in film|reboot and original film trilogy]], respectively.\\n\\n==References==\\n{{Reflist}}\\n\\n==External links==\\n* [http://marvel.wikia.com/Andrew_Maguire_%28Earth-616%29 Alpha] at Marvel Wiki\\n\\n{{Spider-Man}}\\n\\n[[Category:Characters created by Dan Slott]]\\n[[Category:Comics characters introduced in 2012]]\\n[[Category:Fictional characters from New York]]\\n[[Category:Fictional sidekicks]]\\n[[Category:Marvel Comics characters who can move at superhuman speeds]]\\n[[Category:Marvel Comics characters with superhuman strength]]\\n[[Category:Marvel Comics mutates]]\\n[[Category:Marvel Comics superheroes]]"}]}}}}'