b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"38566668":{"pageid":38566668,"ns":0,"title":"Anachronism (comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{Infobox comics character\\n<!--Wikipedia:WikiProject Comics-->\\n| character_name = Anachronism\\n| image          = <!-- filename format only -->\\n| imagesize      = <!-- default 250 -->\\n| caption        = \\n| publisher      = [[Marvel Comics]]\\n| debut          = \'\'[[Avengers Arena]]\'\' #1 (December 2012)\\n| first_series   = \\n| first_episode  = \\n| first_comic    = \\n| creators       = [[Dennis Hopeless]] <br />[[Kev Walker]]\\n| voiced_by      = \\n| based_on       = \\n| alter_ego      = \\n| full_name      = Aiden\\n| species        = <!-- optional -->\\n| homeworld      = <!-- optional -->\\n| alliances      = <!-- optional -->\\n| partners       = <!-- optional -->\\n| supports       = <!-- optional -->\\n| aliases        = <!-- optional -->\\n| powers         = \\n| cat            = \\n| subcat         = \\n| hero           = \\n| villain        = \\n| sortkey        = Anachronism (comics)\\n| addcharcat#    = \\n}}\\n\\n\'\'\'Anachronism\'\'\' (\'\'\'Aiden\'\'\') is a fictional character from [[Marvel Comics]].\\n\\n==Publication history==\\nAnachronism first appeared in issue #1 of the \'\'[[Avengers Arena]]\'\' series as part of the \'\'[[Marvel NOW!]]\'\' event, and was created by [[Dennis Hopeless]] and [[Kev Walker]].\\n\\nAnachronism appears as one of the main characters in \'\'[[Avengers Undercover]]\'\' beginning in 2014.<ref>{{cite web|url=http://www.comicbookresources.com/?page=article&id=48419 |title=NYCC EXCLUSIVE: HOPELESS IS SEDUCED BY EVIL IN \\"AVENGERS UNDERCOVER\\" |publisher=Comicbookresources.com |date=2013-10-11 |accessdate=2013-10-12}}</ref>\\n\\n==Fictional character biography==\\nAiden was a fat kid who was interested in video games and eating fast food. One day he mysteriously gained the appearance of an immortal Celtic warlord. Anachronism is one of sixteen teenagers kidnapped by [[Arcade (Marvel Comics)|Arcade]] who forces them to fight each other to the death in his latest version of Murderworld.<ref>\'\'Avengers Arena\'\' #1</ref> He is part of the Braddock Academy group (consisting of [[Apex (comics)|Apex]], [[Kid Briton]], [[Cullen Bloodstone|Bloodstone]] and [[Nara (comics)|Nara]]) which is joined by [[Deathlocket|Death Locket]] despite death threats from Kid Briton and Nara. Death Locket started bonding with Apex as she introduces her to the rest of the Braddock Academy.<ref>\'\'Avengers Arena\'\' #2</ref> There is discord in the Braddock Academy\'s ranks as Anachronism and Kid Briton get into an argument. An earthquake then separates Bloodstone and Anachronism from Apex, Nara, Kid Briton, and Death Locket.<ref>\'\'Avengers Arena\'\' #5</ref> Nara, Anachronism, and Bloodstone manage to survive falling into the chasm and come to the conclusion that Apex is manipulating Death Locket and Kid Briton to her own ends. The trio is then teleported by Arcade to the supply cache at Quadrant 2 just as Apex, Death Locket, and Kid Briton arrive. Nara and Apex start arguing and Apex confirms that she was the one who ordered Death Locket to attack Nara. Kid Briton tries to intervene as Nara continues calling him a \\"weak puppet.\\" An irate Kid Briton attempts to kill Nara for insulting him only to be beheaded by Anachronism.<ref>\'\'Avengers Arena\'\' #6</ref>\\n\\nAfter being injured by Apex, [[Nico Minoru|Nico]] sacrifices herself by staying behind in order to get the other survivors to safety.<ref>\'\'Avengers Arena\'\' #10</ref> The remaining teenage heroes catch up to [[Reptil]] and [[Hazmat (comics)|Hazmat]] and are invited to have shark steaks with them. Cullen Bloodstone confronts Reptil about their camping out on the beach while a war\'s going off elsewhere. [[Cammi (comics)|Cammi]] interjects to agree with Cullen Bloodstone before saying she\'s heading out to either find Nico or avenge her. Reptil heads back to shake Hazmat out of her funk. Everyone agrees to go back out into Murderworld.<ref>\'\'Avengers Arena\'\' #11</ref>\\n\\nBloodstone, Cammi, Anachronism and Nara soon get separated from Reptil, Hazmat and X-23. He soon lashes out at Aiden and Cammi.  Aiden and Nara are then seen being attacked by a feral X-23, during the time when Nara reveals to Aiden that she believes Cullen is both gay and in love with him (jealousy explaining his antagonistic behavior to Nara). Cullen decides to take off his ring and fight X-23 in his unstable form. Leaving Aiden, Nara and Cammi in the middle.<ref>\'\'Avengers Arena\'\' #14</ref> Cullen successfully takes down X-23, but is now wild and out of control. He is impervious to [[Nico Minoru]]\'s upgraded magic, as well as [[Chase Stein]]\'s [[Darkhawk (comics)|Darkhawk]] form. Nara went into the sea to retrieve the ring, and she then touched it to Cullen\'s skin, leaving him depowered and naked, but Nara received serious injuries and died soon after in Anachronism\'s arms.<ref>\'\'Avengers Arena\'\' #15</ref> When Cullen, still naked, approaches Anachronism to offer sympathy, Anachronism then slices and beats on Cullen in a fit of rage, seriously wounding Cullen, and Cammi has to break up the fight. Reptil asks Nico and Chase for help breaking up the fight, but Nico insists she and Chase stay out of it. At Nico\'s command, Chase then turns into Darkhawk and sucker-punches Reptil as part of some secret plan that he and Nico devised. Chase showed regret at having to attack Reptil.<ref>\'\'Avengers Arena\'\' #16</ref> When Chase refused to let Cammi stop Nico, she broke his arm and leg, taking the Darkhawk amulet for herself in order to stop Nico from killing everyone.<ref>\'\'Avengers Arena\'\' #17</ref> Cammi gives Chase the amulet again when Apex unleashes bugs, sentient typhoon, and weaponized sand to attack the remaining teens on Murderworld.<ref>\'\'Avengers Arena\'\' #18</ref>\\n\\n===Avengers Undercover===\\nOnce news broke about Arcade\'s kidnappings, Anachronism and the other Murder World Survivors became infamous.<ref>\'\'Avengers Undercover\'\' #1</ref> When Anachronism reveals Bloodstone\'s gone missing, all the survivors team up to head to Bagalia to find him. Anachronism charges into a bar to retrieve his friend despite protests from the others. Once they find Bloodstone, he reveals that he enjoys life among the villains, and the others, minus Cammi, start to enjoy it as well. Hazmat dances with Anachronism, comforting him about how he and Bloodstone are still at odds over Nara\'s death. When Cammi tries to tell the others to leave, Bloodstone instead has [[Daimon Hellstrom]] teleport the group to Arcade\'s latest party so they can kill him.<ref>\'\'Avengers Undercover\'\' #2</ref>\\n\\n==Powers and abilities==\\nAnachronism inherited the body of an immortal Celtic warlord and fights with a big axe. Anachronism has half his mind shared with the previous inheritor of the body who constantly seeks violence. Anachronism fights to keep control of his body.\\n\\n==References==\\n{{Reflist}}\\n\\n==External links==\\n* [http://www.comicvine.com/anachronism/4005-86739/ Anachronism] at Comic Vine\\n\\n[[Category:Comics characters introduced in 2012]]\\n[[Category:Marvel Comics superheroes]]"}]}}}}'