b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"771309":{"pageid":771309,"ns":0,"title":"Chamber (comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{multiple issues|\\n{{Primary sources|date=May 2011}}\\n{{Notability|date=May 2011}}\\n}}\\n\\n{{Superherobox| <!--Wikipedia:WikiProject Comics-->\\nimage=[[Image:ChamberImage.jpg|215px]]\\n|caption=Chamber. Art by [[Scott Kolins]].\\n|comic_color=background:#ff8080\\n|character_name=Chamber\\n|real_name=Jonothon \\"Jono\\" Evan Starsmore\\n|species=[[Mutant (Marvel Comics)|Human Mutant]]|debut=[[Generation X (comics)|Generation X]] #1 (November 1994)\\n|creators= [[Scott Lobdell]]<br>[[Chris Bachalo]]\\n|publisher=[[Marvel Comics]]\\n|alliance_color=background:#ffc0c0\\n|alliances=[[New Warriors]]<br/>[[Clan Akkaba]]<br/>[[Generation X (comics)|Generation X]]<br/>[[X-Men]]<br/>[[Weapon X]]<br/>[[X-Mansion#Post X-Men: Schism|Jean Grey School]]\\n|aliases=Chamber, Decibel\\n|powers=\'\'\'Currently:\'\'\'<br>Possesses a furnace of [[psychic|psionic]] [[energy]] in chest, [[Telepathy]]<br>\'\'\'Formerly:\'\'\'<br>Created solidified sound constructs\\n|}}\\n\\n\'\'\'Jonothon \\"Jono\\" Evan Starsmore\'\'\', better known as \'\'\'Chamber\'\'\' or \'\'\'Decibel\'\'\', is a fictional character, a [[Marvel Comics]] [[superhero]] associated with the [[X-Men]] and the [[New Warriors]].\\n\\nA [[United Kingdom|British]] [[Mutant (Marvel Comics)|mutant]], Jono possessed the ability to cast [[List of comic book superpowers#Energy blasts|energy blast]]s from his chest. He had limited control of his power and destroyed much of his chest and lower face when his powers emerged. Recently, he lost his powers on \'M Day\' and now uses technology to give himself sonic based abilities.\\n\\nJono was a member of the X-Men\'s junior team Generation X, although he was sullen and moody and had difficulty bonding with teammates. He has since been offered a permanent position in the X-Men\'s teaching staff.\\n\\n==Publication history==\\n{{Expand section|date=August 2010}}\\nCreated by writer [[Scott Lobdell]] and artist [[Chris Bachalo]], he first appeared in \'\'[[Generation X (comics)|Generation X]]\'\' #1 (September 1994).\\n\\n==Fictional character biography==\\n\\n===Origin===\\n[[Image:Chamber O.JPG|thumb|left|px|Chamber\'s powers first manifest, art by Georges Jeanty]]\\nJonothon Evan Starsmore (\\"Jono\\" to his friends) is a native of [[London]] and a mutant who possesses a furnace of [[psionics|psionic]] [[energy]] in his chest. This power first manifested in an explosion during a party he was attending with then girlfriend [[Gayle Edgerton]]. Its initial manifestation destroyed much of his chest and lower face and crippled Gayle. As a result of his disfiguration, Jono can only speak via [[telepathy]]. He does not eat, drink, or breathe; it is believed{{Citation needed|date=August 2008}} that either the psionic energy sustains him without needing his vital organs, or that his body is merely a shell, and he is actually made up of psionic energy. This is further supported by the fact that Jono is immune to the \\"Death Factor\\" of [[Omega Red]], meaning that he is not sustained by \\"[[wiktionary:life force|life force]]\\".  The primary manifestation of his abilities is his ability to fire powerful blasts of psionic force. It has been implied at numerous times that Jono is potentially one of the most powerful mutants to walk the earth (most notably the scale of his mutagenic aura as seen by [[Emplate]] in \'\'Generation X\'\' #1, also at times when he is seen to \'cut loose\' with his abilities) but his emotional issues have apparently prevented him from significantly exploring this potential. His disfiguration also left Jono sullen and angry and his teammates have often found him difficult to get along with.{{Issue|date=April 2011}}\\n\\n===Generation X===\\n[[Image:Chamber lovehusk.jpg|thumb|right|180px|Chamber confesses his love to Husk, art by Terry Dodson]]\\nShortly after his mutant powers manifested, Jonothon accepted an invitation to join [[X-Mansion|Xavier\'s School for Gifted Youngsters]]. At the airport, he was attacked by [[Emplate]], a vicious evil mutant who feeds on mutant [[DNA|genetic material]] to survive, and the fledgling team of Generation X ([[M (comics)|M]], [[Husk (comics)|Husk]], [[Synch (comics)|Synch]], [[Skin (Marvel Comics)|Skin]], and [[Jubilee (comics)|Jubilee]]) arrived to fight Emplate off.<ref name=\\"GenX 1\\">\'\'Generation X\'\' #1</ref> Shortly after, Chamber convinced the crazed [[Penance (X-Men)|Penance]] to stop attacking the team, as he could sympathize with her freakish appearance; she came to live with the team.<ref name=\\"GenX 2\\">\'\'Generation X\'\' #2</ref>\\n\\nEmplate captured Chamber with Gayle\'s help, and then imprisoned both of them. Gayle blamed Jono for ruining her life, but the two managed to get over the pain after the rest of Generation X freed them.<ref name=\\"GenX 14\\">\'\'Generation X\'\' #14</ref> Chamber later became romantically involved with Husk, although their relationship was awkward and strained, and was terminated on more than one occasion when Jono self-sabotaged the growing relationship when he realized that he could not offer Husk the normal life he believed she wanted. Although he rebuilt bridges with her later, he soon returned to the same mind-set and the couple never entered a serious relationship, despite the chemistry between them. Their friendship was strained for the rest of the time they spent together.{{Issue|date=April 2011}}\\n\\nJono\'s greatest victory during the time he was with Generation X was when Banshee was attacked by the mutant serial killer [[Omega Red]]. With their teacher incapacitated, Chamber led the pursuit of the mutant and after the rest of the team was defeated, Chamber\'s immunity to Omega Red\'s death spores, as well as some tactical thinking on his part, enabled him to single handedly defeat the killer.<ref name=\\"GenX 11\\">\'\'Generation X\'\' #11</ref>\\n\\nDespite his time at the school, Jono was never able to gain full control of his abilities. Chamber grew even more depressed when he saw that Synch, who could duplicate a nearby mutant\'s powers, was more proficient with Chamber\'s own powers than Chamber himself was. When the school was outed as harboring mutant students, an anti-mutant group attacked the school. After Synch was killed preventing a [[bomb]] from killing nearby human students, the [[Generation X (comics)|Generation X]] kids felt that their training was over, and they had to use their powers to help humanity. Chamber was the one student to be offered a place on the [[X-Men]] by [[Charles Xavier]],<ref>\'\'Generation X\'\' #75</ref> but apparently failed to join the group when expected.{{Issue|date=April 2011}}\\n\\n===X-Man and Weapon X===\\n[[Image:Chamber mday.jpg|thumb|left|180px|Decimation almost destroys Chamber. Art by Scott Kolins.]]\\nAfter failing to join the X-Men, Chamber returned to London, where he hooked up with [[celebrity|pop star]] Sugar Kane, creating a [[publicity]] blitz for the singer, but she and Chamber parted company after her manager staged her abduction by anti-mutant forces following a phony tabloid story about her pregnancy by Jono. The X-Men met with Chamber in London and persuaded him to join the team after all, after claiming that the X-Men offered a place that he could finally fit in. He remained on the team for some time, but often showed frustration with being treated as a junior member by his teammates, even after playing a role in the defeat of [[Vanisher]] and [[Mystique (comics)|Mystique]]\'s [[Brotherhood of Mutants]] when they infiltrated Banshee\'s [[X-Corps]].{{Issue|date=April 2011}}\\n\\nFollowing a strained time on the X-Men, Chamber investigated the apparent murders of mutant students at [[Empire State University]]<ref name=\\"mnyc\\">{{cite book  | last = Sanderson  | first = Peter  | authorlink =   | coauthors =   | title = The Marvel Comics Guide to New York City  | publisher = [[Pocket Books]]  | year = 2007  | location = New York City  | pages = 30\\u201333  | url =   | doi =   | id =   | isbn = 1-4165-3141-6}}</ref> on their behalf.  He became romantically entangled with the shapeshifting reptilian mutant, Amber,<ref>http://www.marvunapp.com/Appendix/ambercha.htm</ref> who was the only mutant student to remain at ESU when they shut down their mutant program, but the relationship quickly ended before it began when Amber came to believe he was only interested in her when she used her shape-shifting abilities to take on a more conventionally attractive form. After that he asked to be relieved from active duty with the X-Men, claiming that he still had much to learn.{{Issue|date=April 2011}}\\n\\nWhile he was back at the school, Chamber saw Husk in the arms of [[Warren Worthington III|Archangel]]. He also saw the death of his friend Skin after the mutant was crucified on the lawn of the school by the [[Church of Humanity (comics)|Church of Humanity]]. After an awkward period with Husk, the X-Men were called to a bar where Jono had apparently given into his anger. He attacked Archangel before Wolverine was able to subdue him. Chamber was turned over to the authorities and while in prison, locked in a power-dampening helmet, Chamber received a visit from [[Brent Jackson]], who offered him an invitation to join the [[Weapon X]] program. He accepted. It was later revealed that the fight and public falling out with the X-Men had been planned to draw Weapon X into recruiting him. After infiltrating them, Weapon X restored his damaged body and he was sent on a mission to kill [[John Sublime]]. He apparently did so, convincing Weapon X of his loyalty, but after stowing aboard a transport to the Neverland concentration camp, he vanished. It was later revealed in the \'\'Weapon X: Days of Future Now\'\' miniseries that Chamber had been captured and brainwashed into loyalty to the program.{{Issue|date=April 2011}}\\n\\nIn the second \'\'[[Runaways (comics)|Runaways]]\'\' series, it initially appeared Jono had damaged his face again and joined a new team of retired teenage superheroes called [[Loners|Excelsior]], but in \'\'Runaways\'\' vol. 2 #6 it was [[Dramatic irony|revealed]] that this was merely [[Geoffrey Wilder]], the enemy of the teenage team the [[Runaways (comics)|Runaways]] impersonating him using a magic amulet.{{Issue|date=April 2011}}\\n\\n===Decimation===\\n[[Image:Chamberpacalypse.jpg|thumb|right|180px|Chamber is reborn as the pride of Clan Akkaba, art by Scott Kolins]]\\nFollowing the warping of reality by the [[Scarlet Witch]], Jono was one of the many mutants who were depowered when reality was restored. Apparently, his powers failed during a mission with Weapon X. It was revealed that [[Beast (comics)|Beast]] was able to save his life after the loss of his powers, but the exact circumstances are unknown. In Generation M #1, as his lower jaw, chest, and several fairly vital organs were missing once again, the X-Men left him to be cared for at a hospital on life support.\\n\\nJono was moved to a hospital in England, but was abducted by his therapist a few weeks later - his therapist being [[Frederick Slade]], a member of the [[Clan Akkaba]], the direct descendants of Apocalypse and distant relatives of Jono. Under orders of [[Ozymandias (Marvel Comics)|Ozymandias]], Jono was afterwards completely healed by the Clan who gave him massive amounts of Apocalypse\'s blood, restoring his body. However, he took on the pigmentation and appearance of a younger version of Apocalypse. As a direct descendant himself of Apocalyspe, Jono was automatically a member of the Clan and was even welcomed by its ruling council, but he rejected their offer to formally join them. Jono was then approached by the UK based superhero team [[Excalibur (comics)|Excalibur]] to join them too, but he also refused, claiming he just wanted to be left alone. A later scan of Jono\'s residual energy signature has revealed that his powers have possibly evolved to [[Mutant (Marvel Comics)#Omega-level mutants|Omega-level]]. However, if Chamber has any such abilities, they appear to be latent.<ref>\'\'New Excalibur\'\' #9</ref>\\n\\n===New Warriors===\\n[[Image:Chamber revealed as Decibel.jpg|thumb|left|180px|Decibel, art by Paco Medina]]Jono yet again resurfaced, now using the codename Decibel as a member of [[Donyell Taylor|Night Thrasher]]\'s most recent incarnation of the [[New Warriors]].<ref>\'\'New Warriors\'\' vol. 4 #3</ref> In this new persona, Jono had a hi-tech suit, which gave him the ability to create solidified sound constructs. He revealed that he chose those powers because he did not want to be a weapon of destruction anymore and could now create.<ref>\'\'New Warriors\'\' vol. 4 #7</ref> He served with the group for the duration, until it was decided that they should disband. He was last seen departing in the company of Jubilee, and other surviving members of the team.{{Issue|date=April 2011}}\\n\\n===Age of X===\\nJono eventually made his way to the X-Men\'s new Island nation of [[Utopia (comics)|Utopia]]. Shortly after his arrival, one of the split-personalities of Xavier\'s son [[Legion (Marvel Comics)|Legion]] re-wrote the history of the X-Men turning himself into a hero. In this re-written world, Jono was once again referred to as Chamber and had regained his lost mutant powers, but also lost the body restorations given to him by Clan Akkaba. When normality was finally restored, Jono was one of the few X-Men who retained their physical changes from this altered reality. Now once again in possession of a gaping hole in his chest and jaw, Jono submitted to observation by the X-Men\'s resident biologist, Dr. [[Kavita Rao]].<ref>\'\'X-Men Legacy\'\' #248</ref>\\n\\n===Schism===\\nChamber is mentioned by the [[Stepford Cuckoos]] as responding to a [[Sentinel (comics)|Sentinel]] threat in Berlin alongside [[Warpath (comics)|Warpath]].<ref>\'\'X-Men: Schism\'\' #2</ref> After the conflict of leaders between Wolverine and Cyclops, Chamber chose to join Wolverine at the new [[X-Mansion]], now the \'\'Jean Grey School for Higher Learning\'\'.<ref>X-Men: Regenesis\'\' #1</ref>\\n\\n===Wolverine and the X-Men===\\nChamber is now teaching a course on \\"Coping With Physical Changes\\" at the Jean Grey School for Higher Learning. He\'s shown defending his students from an attack by [[Michael Pointer (comics)|Weapon Omega]] while giving a lecture in class.<ref>\'\'X-Men Legacy\'\' #264</ref> Chamber was vaporized out of existence while battling one of Legion\'s multiple personalities,<ref>\\"X-Men Legacy\\" #22</ref> but was later restored to life when Legion later altered reality.<ref>\\"X-Men Legacy\\" #24</ref>\\n\\n==Powers and abilities==\\n\\nJono\'s thoracic and abdominal cavities are a chamber for a furnace of psionic energy capable of nuclear fission whose output can be projected as wide blasts of concussive force or [[laser]]-like focused beams that disrupt atomic bonds. The initial manifestation of said powers has destroyed most of his internal organs along with his mouth and chest, effectively killing his body. Chamber requires no food or oxygen and is seemingly indestructible as he has disintegrated his own body along with D\'spayre\'s down to their sub-atomic components in a kamikaze attack and later reconstituted himself (Generation X Annual \'97). His bizarre physiology suggests he is actually a being of pure psionic energy inhabiting a dead organic shell that he can disintegrate and reassemble from memory, a hypothesis several characters have put forward in comics. Chamber can also project his thoughts into other people\'s minds, but cannot read the thoughts of  others, which enables him to communicate without a mouth. At one point, fellow Generation X member [[Synch (comics)|Synch]] used his own mutant powers to tap into and copy Jono\'s powers and fly. Jono himself has never exhibited this ability before or since.\\n\\nAfter being depowered by the events of [[House of M]], Jono\'s body was rebuilt by Clan Akkaba in the image of Apocalypse and he later employed  technology to mimic sonic powers as Decibel. These powers included flight, sonic blasts and the creation of solid energy constructs. He has since been restored to his original form and powers by the events of Age of X.\\n\\n==Other versions==\\n\\n===Age of Apocalypse===\\n[[Image:Gnx1a.jpeg|thumb|right|180px|Chamber leads Generation Next, Art Chris Bachalo]]\\nIn the [[Age of Apocalypse]] timeline, Chamber was a much different person from his mainstream counterpart. He was the leader of [[Age of Apocalypse#Generation Next|Generation Next]] under the training of [[Kitty Pryde|Shadowcat]] and [[Colossus (comics)|Colossus]], who had rescued Chamber from [[Mikhail Rasputin]], one of Apocalypse\'s Horsemen. His power had been discovered earlier and was placed under his control via a cybernetic chest plate used to regulate his power usage; as such, his face and body were whole with no parts lost to his power. He also had an open and passionate relationship with fellow mutant [[Husk (comics)#Age of Apocalypse|Husk]].<ref>\'\'Generation Next\'\' #1</ref> He was killed along with the rest of his team when they infiltrated [[Sugar Man]]\'s lair and were abandoned by Colossus.<ref>\'\'Generation Next\'\' #4</ref>\\n\\n==Name==\\nFor all of the character\'s Generation X appearances, his name was spelled as Jonothon Starsmore. However, following his appearances in this title, his name started appearing spelled Jonothan, starting with his appearances in \'\'Uncanny X-Men\'\'. The reason for this change is unclear.\\n\\n==References==\\n{{More footnotes|date=November 2008}}\\n{{Reflist|2}}\\n\\n==External links==\\n*[http://www.uncannyxmen.net/db/spotlight/showquestion.asp?faq=10&fldAuto=93 Uncannyxmen.net Spotlight On...Chamber]\\n*[http://uncannyxmen.net/characters/chamber UncannyXmen.net Spotlight on Chamber]\\n*[http://marvel.com/universe/Chamber Chamber on the Marvel Universe Character Bio Wiki]\\n\\n{{Weapon Plus}}\\n{{X-Men}}\\n\\n{{DEFAULTSORT:Chamber (Comics)}}\\n[[Category:Characters created by Scott Lobdell]]\\n[[Category:Characters created by Chris Bachalo]]\\n[[Category:Comics characters introduced in 1994]]\\n[[Category:Fictional people from London]]\\n[[Category:Fictional schoolteachers]]\\n[[Category:Fictional secret agents and spies]]\\n[[Category:Marvel Comics telepaths]]\\n[[Category:Marvel Comics mutants]]\\n[[Category:Marvel Comics mutates]]\\n[[Category:Marvel Comics superheroes]]\\n[[Category:Marvel Comics titles]]"}]}}}}'