b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"992067":{"pageid":992067,"ns":0,"title":"Domino (comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\\n|image=[[File:DominoX-Men.jpg|250px]]\\n|character_name=Domino\\n|real_name=Neena Thurman\\n|species=[[Mutant (Marvel Comics)|Human Mutant]]\\n|publisher=[[Marvel Comics]]\\n|debut=\'\'\'Impersonated by [[Copycat (Marvel Comics)|Copycat]]:\'\'\'<br> \'\'[[The New Mutants]]\'\' #98 (February  1991)<br>\'\'\'Herself:\'\'\'<br> \'\'[[X-Force]]\'\' #8 (March 1992)\\n|creators=[[Fabian Nicieza]]<br>[[Rob Liefeld]]\\n|alliance_color=background:#ffc0c0\\n|alliances=[[X-Men]]<ref>\'\'Official Handbook of the Marvel Universe A to Z,\'\' vol. 13 (2010) Marvel Comics</ref><br/>[[X-Force]]<br/>[[X-Men: The 198|The 198]]<br/>[[X-Corporation]]<br/>[[Underground (comics)|Underground]]<br/>[[Six Pack (comics)|Six Pack]]\\n|partners=[[Cable (comics)|Cable]]\\n|aliases= Neena Beatrice Thurman, Beatrice Thurman, Samantha Wu, Tamara Winter, Elena Vladescu, Jessica Marie Costello, Luisa Mendoza, Christina Elizabeth Alioso, Priscilla Sutherland, Hope Eldridge\\n|powers=[[List of comic book superpowers#Probability manipulation|Probability manipulation]]<br> Superb markswoman with various [[firearms]]<br> Skilled hand-to-hand combatant\\n|}}\\n\'\'\'Domino\'\'\' (\'\'\'Neena Thurman\'\'\') is a [[Marvel Comics]] [[fictional character|character]], best known as a member of the [[X-Men]] offshoot [[X-Force]]. Created by writer [[Fabian Nicieza]] and artist/co-writer [[Rob Liefeld]], she first fully appeared in \'\'X-Force,\'\' vol. 1 #11 (June 1992).\\n\\nIn addition to her exceptional [[marksman]]ship and hand-to-hand skills, Domino possesses [[Mutant (Marvel Comics)|mutant]] [[probability]]-altering powers, similar to those of the X-Man [[Longshot]]. She often uses her skills as a [[mercenary]], but has also been the partner, confidante, and lover of the [[superhero]] [[Cable (comics)|Cable]], a lieutenant in his militant group X-Force, and a member of the X-Men.\\n\\n==Publication history==\\nApart from being a mainstay character in the first series of \'\'X-Force,\'\' Domino has had two limited self-titled series, one of which had her teaming with [[Puck (comics)|Puck]] against [[Lady Deathstrike]] and [[Donald Pierce]]. The second revealed her childhood.\\n\\nDomino did not properly appear in Marvel comics until after a pair of false starts. A Domino imposter, a mutant shapeshifter named [[Copycat (Marvel Comics)|Copycat]], first appeared in \'\'[[New Mutants]],\'\' vol. 1 #98 (February  1991), although the real Domino did not appear in that issue. Domino made a brief appearance in a flashback in \'\'X-Force,\'\' vol. 1 #8 (March  1992), and made her first actual present-day appearance on the last page of issue #11 (June 1992). She appeared in a number of issues of \'\'Cable & Deadpool\'\'<ref>\'\'Cable and Deadpool\'\' #7\\u201312, 27\\u201329, 33\\u201335, 40\\u201342</ref> and joined the first Wolverine-led X-Force as of \'\'X-Force,\'\' vol. 3 #8 (December  2008).\\n\\nDomino appeared in her own three-issue miniseries with Wolverine entitled \'\'X-Force: Sex and Violence,\'\' written by [[Christopher Yost]] and [[Craig Kyle]] and drawn by [[Gabriele Dell\'Otto]].<ref name=\\"sexandviolence\\">{{cite web|url=http://www.comicbookresources.com/?page=article&id=19903|title=NYCC: Yost & Kyle on \'X-Force: Sex and Violence\'|last=Manning|first=Shaun|date=2009-02-07|publisher=Comic Book Resources|accessdate=2009-06-28}}</ref> The story centers upon Domino and Wolverine\'s mission to resolve a situation from Domino\'s recent past.<ref name=\\"sexandviolence\\"/> Chris Yost has said, \\"It\'s a chance for us to go in-depth into a couple of the characters. In the story, Domino has a hit put out on her and Wolverine finds out about it. Essentially, it\'s the two of them going out to get that hit removed.\\"<ref name=\\"sexandviolence\\"/> Yost adds that the characters are up against the worst killers on the planet.<ref name=\\"wizardq&a\\">{{cite web|url=http://www.wizarduniverse.com/020709nyccchrisyost.html|title=[NYCC] \'Sex & Violence\' Q&A With Christopher Yost|last=Sunu|first=Steve|date=2009-02-07|publisher=Wizard Universe|accessdate=2009-06-28}} {{Dead link|date=November 2010|bot=H3llBot}}</ref>\\n\\nDomino was part of the main roster in \'\'[[Cable and X-Force]]\'\' (by [[Dennis Hopeless]] and [[Salvador Larroca]]), from 2012 to 2014.<ref name=\\"Cable&X-Force\\">{{cite web |url=http://www.comicbookresources.com/?page=article&id=40999 |title=EXCLUSIVE: The Future is Hopeless for \\"Cable and X-Force\\" |last=Richards |first=Dave |date=14 September 2012 |publisher=Comic Book Resources |accessdate=14 September 2012}}</ref><ref name=\\"C&XF\\">{{cite web |url=http://www.comicbookresources.com/?page=article&id=49773 |title=X-POSITION: Hopeless Looks Back on \\"Cable and X-Force\\" |last=Sunu |first=Steve |date=17 December 2013 |publisher=Comic Book Resources |accessdate=23 November 2014}}</ref>\\n\\nDomino guest stars in the 2014 \'\'[[X-Force#X-Force Volume 4: 2014|X-Force]]\'\', beginning from issue #7.<ref name=\\"NewDomino\\">{{cite web |url=http://www.comicbookresources.com/?page=preview&id=22455 |title=Preview: X-Force #7 |date=3 July 2014 |publisher=Comic Book Resources |accessdate=23 November 2014}}</ref>\\n\\n==Fictional character biography==\\nThe woman who would become known as Domino is actually the result of a top-secret government breeding program intended to develop the perfect weapon. Domino was the only test subject to survive, but her \\"luck\\" power was deemed a failure at meeting the project\'s goals. Her biological mother broke her out of the project and left her with Father Rudolpho Boschelli in the Church of the Sacred Heart in Chicago. Domino eventually left the Church and became a mercenary. One of her first jobs was to stop \\"Operation: Jericho,\\" which was a remote-controlled warbot project. Domino wrecked the robot, but in the process fried the mind of the soldier controlling it. She was then assigned to guard the genius Dr. Milo Thurman, whose analytical ability made him too dangerous for the government to let roam free. Somehow, Domino and Thurman fell in love and were married, apparently officially. Thurman had a thing for Dante\'s \'\'[[Inferno (Dante)|Inferno]]\'\' and called Domino \\"Beatrice.\\" The two separated after a raid on the facility by AIM members, with Milo believing Domino had been killed during the altercation.<ref>\'\'Domino,\'\' vol. 1 #1\\u20133 (January \\u2013March  1997)</ref>\\n\\n===Six Pack===\\nShe then began work as a mercenary and helped found the mercenary band the [[Six Pack (comics)|Six Pack]], which introduced her to the mutant time traveler [[Cable (comics)|Cable]]. Domino worked with the Six Pack for some time, taking on many missions for the pure cash value. The Six Pack was very brutal in their adventures, often shooting down entire crowds of people who got in their way. The team, also known as the Wild Pack, went on missions in Iran,<ref name=\\"Blood&Steel\\">flashback in \'\'Cable: Blood and Steel\'\' #1\\u20132 (October \\u2013November  1992)</ref> and participated in a raid on a [[Hydra (Marvel Comics)|HYDRA]] base,<ref>flashback in \'\'X-Force,\'\' vol. 1 #8 (March  1992)</ref> which Domino participated in. During her time with the Wild Pack, she had her first confrontations with [[Stryfe]], Cable\'s evil clone, in Afghanistan and Uruguay.<ref name=\\"Blood&Steel\\"/>\\n\\n===Replacement===\\nWhen Cable became the leader of the New Mutants following their break from the [[X-Men]], \\"Domino\\" (actually [[Copycat (Marvel Comics)|Copycat]])<ref>\'\'New Mutants,\'\' vol. 1 #98 (February  1991)</ref> joined him as his field leader, and stayed with the team as they changed from the New Mutants to X-Force. When it was revealed that the real Domino was actually a prisoner of the [[supervillain]] [[Genesis (comics)|Tolliver]] for over a year,<ref>\'\'X-Force,\'\' vol. 1 #11 (June 1992)</ref> X-Force rejected the Domino imposter and, with Cable\'s reassurances, planned to rescue the real Domino and welcome her onto the team.\\n\\nMeanwhile, the real Domino learned of Tolliver\'s destruction of X-Force\'s Adirondack base, and planned her escape.<ref>\'\'X-Force,\'\' vol. 1 #13 (August  1992)</ref> Cable found her at Tolliver\'s Italian home, along with her apparently murdered double.<ref>\'\'X-Force,\'\' vol. 1 #14 (September  1992)</ref> Domino was accidentally freed by [[Deadpool (comics)|Deadpool]], whom she shot. Cable sent her to find X-Force. She escaped on Tolliver\'s helicopter, and survived a fall from Tolliver\'s helicopter into the sea.<ref>\'\'X-Force,\'\' vol. 1 #15 (October  1992)</ref> She found X-Force and joined the team.\\n\\n===Joining X-Force===\\nDomino stayed with the team for most of its existence, becoming its \'\'[[de facto]]\'\' leader when Cable left the team on several occasions. For a while, she was a prisoner of the forces of [[Bastion (comics)|Bastion]], which severely affected her mentally and physically. During X-Force\'s existence, Domino had several solo adventures. During one, she was forced to kill her mentally ill, ex\\u2013Six Pack partner [[Grizzly (comics)#Grizzly (Theodore Winchester)|Grizzly]].<ref>\'\'Cable,\'\' vol. 1 #24 (October  1995)</ref>\\n\\n===X-Corporation===\\n{{Refimprove section|date=November 2010}}\\nWhen X-Force briefly disbanded, Domino joined the [[X-Corporation]].{{issue|date=November 2010}} While working in their Hong Kong branch, Domino\'s partner, Risque, was murdered and she summoned the core group of the X-Men to help investigate. Together the mutants uncovered the truth behind John Sublime\'s \\"Third Species\\" movement: he was harvesting body parts from living mutants to create his U-Men. They also helped free the mutant named Xorn.<ref>\'\'New X-Men Annual 2001\'\' (September  2001)</ref>\\n\\nDuring her solo period, Domino began to search for her mother, Beatrice, and clues to her past. In her search  Domino learned that the Project: Armageddon, was still active. Led to a secret base in Florida Domino finds a mutant boy named Lazarus who had the same eye tattoo imprisoned there for observation.{{issue|date=November 2010}} Lazarus turns out to be her half-brother with powerful emotion controlling abilities and the true result of the Perfect Weapon program.{{issue|date=November 2010}} Soon after attempting to liberate him, however, the Armajesuits, a fanatical group of quasi-priests who were against the project, arrive to kill Lazarus and prevent him from reaching his full development. Domino discovers that her mother leads the Armajesuits and is forced to shoot her to save Lazarus\'s life. She takes Lazarus to Father Boschelli and the Church she was raised in for sanctuary, although unbeknown to her, Beatrice subsequently abducts Lazarus from there.<ref>\'\'Domino,\'\' vol. 2 #1\\u20134 (June\\u2013August  2003)</ref>\\n\\n===Cable and Deadpool===\\nLater, she was employed by [[S.H.I.E.L.D.]] as a member of the new Six Pack. Alongside [[G. W. Bridge]], Hammer, [[Solo (Marvel Comics)|Solo]], [[Anaconda (comics)|Anaconda]] and [[Constrictor (comics)|Constrictor]], she attacked Cable at his community \'\'Providence,\'\' though she quickly defected to his side after the Six Pack was defeated by Cable and Deadpool. Domino followed Deadpool to Rumekistan, where she assassinated the country\'s dictator, Flag-Smasher, only to find out it was part of a plan to install Cable as leader of that nation. After a conversation with [[Citizen V]], she then attempted to kill Cable, believing that he would lead them to ruin.{{Issue|date=April 2009}}\\n\\n===Civil War===\\nDuring the [[Civil War (comics)|Civil War]], Domino, [[Shatterstar]] and [[Caliban (comics)|Caliban]], under the X-Force name, lead an attack on the [[X-Mansion|Xavier Institute]] and break out more than half of [[X-Men: The 198|the 198]], bringing the tension between the 198 and O*N*E to a head.<ref>[[Civil War: X-Men]] #1 (September  2006)</ref> After her other team, the Six Pack, disbands, she and Cable are allies on Providence, until a fight with Hecatomb causes the island to sink into the ocean, leaving Cable presumed dead.{{Issue|date=May 2009}}\\n\\nDomino is later recruited by her [[G. W. Bridge]] along with [[Silver Sable]] and the Contessa [[Valentina Allegra de Fontaine]] to track down the [[Punisher]]. When a fake Punisher started targeting civilians, she was the only team member to believe in Castle\'s innocence.{{Issue|date=May 2009}}\\n\\n===X-Force===\\nAfter the Punisher stint, Domino finds [[Wolverine (character)|Wolverine]] and X-Force in Tokyo and joins them in trying to capture [[Vanisher]].<ref>\'\'X-Force,\'\' vol. 3 #8 (December  2008)</ref> Questions to Domino\'s authenticity have been raised when her luck powers fail her several times.{{Issue|date=April 2011}}\\n\\nOn behalf of Wolverine, Domino is asked to stop in a cemetery to deliver flowers to a deceased loved one. She encounters [[Spiral (comics)|Spiral]], [[Chimera (comics)|Chimera]] and [[Lady Deathstrike]] who have dug up [[Revanche]]\'s body. After a brief fight she wounds Chimera and the women escape with the body,<ref>\'\'Uncanny X-Men\'\' #508 (June 2009)</ref> but Domino manages to replace [[Jean Grey]]\'s body before the [[Madelyne Pryor|Red Queen]] could take it as her host.<ref>\'\'Uncanny X-Men\'\' #511 (August  2009)</ref>\\n\\nDomino and Wolverine go on a mission to resolve a situation from Domino\'s past.<ref>\'\'X-Force: Sex and Violence\'\'</ref>\\n\\nDomino is the first person to learn [[Thunderbolt Ross|Red Hulk]]\'s identity and is marked for death by him. Doc Samson provides Red Hulk with a list of people (Deadpool, the Punisher, Thundra and Elektra) to kill her. When the group arrives, they find her in a bar with the members of X-Force.<ref>\'\'Hulk,\'\' vol. 2 #14 (August  2009)</ref> Afterwards, she reveals it was her husband who named her Domino.<ref>\'\'Hulk,\'\' vol. 2 #17 (January  2010)</ref>\\n\\n===\'\'X-Men\'\' (Vol 3)===\\nDomino appears post [[X-Men: Regenesis|Regenesis]], as a regular member of [[Storm (Marvel Comics)|Storm]]\'s security team, tasked with the responsibility of safe guarding [[Asteroid M|Utopia]] from all foreign threats.{{issue|date=August 2012}}. She fights with them during the war against the Avengers.{{issue|date=October 2013}}\\n\\n===Back with X-Force===\\nAfter the events of [[Avengers vs. X-Men]], Domino left Utopia like all the mutants who lived there.{{issue|date=October 2013}} She later joins Cable\'s new X-Force group.{{issue|date=March 2013}}\\n\\n==Powers and abilities==\\n{{Unreferenced section|date=October 2009}}\\nDomino is a [[Mutant (Marvel Comics)|mutant]] with the ability to subconsciously and psionically initiate random [[telekinetic]] acts that affect probability in her favor by making improbable (but not impossible) things to occur within her line of sight, thus causing her to have \\"good luck\\" and her opponents to have \\"bad luck.\\" This \\"probability field\\" phenomenon can be anything from an enemy\'s equipment failure to hitting just the right switch with a stray shot to shut down an overloading nuclear reactor. The full extent of her powers is still unknown.\\n\\nThis subconsciously controlled talent is triggered when she is in a stressful situation (such as fighting or escaping). This effect constantly emanates from her body at all times and is completely subconscious. However, it is also largely participatory\\u2014in order for the luck to take effect, Domino herself must engage in an action whose chance she can affect.\\n\\nFor example, if debris falling from the sky was about to hit her in the head, she would still be hurt if she stood still. However, if she tried to avoid it, she would move perfectly to avoid each and every piece about to hit her. In addition, if Domino were to stand before a hail of bullets she would be a bullet-riddled corpse. Instead, she must take action, attempting to avoid the gunfire, and would miraculously bob-and-weave just perfectly to avoid every single shot.\\n\\nAs a byproduct of her abilities, Domino\'s cerebral cortex emits a current of bioelectric pulses down her spine to instinctively guide her movements during such situations, which has the added effect of augmenting her natural reflexes and reactions to superhuman levels.\\n\\nDuring the 198 rebellion at the Xavier Institute, Domino was able to consciously utilize her abilities in order to affect the probability fields of storm clouds above a group of ONE Sentinels, calling down lightning to strike them.\\n\\nDomino is also a superb markswoman with various firearms, highly skilled athlete, excellent swimmer, and adept in use of explosives. She has extensive training in various armed combat techniques and the martial arts, with Olympic-gold level athletic and acrobatic ability. She also seems to be fluent in multiple languages.\\n\\nDomino wears body armor of unknown composition, and carries conventional firearms.  She has also used a staff that fires unspecified ammunition, which can be used for balance when jumping and is equipped with sensors. During her time as an X-Corporation operative, Domino wore contact lenses designed by [[Forge (comics)|Forge]], capable of night vision or, with a triple blink, firing a high intensity laser beam.\\n\\n==Other characters named Domino==\\n\\n===Dominic Dunsinane===\\nA male character named Domino (\'\'\'Dominic Dunsinane\'\'\') aided the [[Scourge of the Underworld]] as an [[informant]].<ref>\'\'Rampaging Hulk,\'\' vol. 1 #4 (August  1977); \'\'Captain America\'\' #320 (August  1986); \'\'U.S.Agent,\'\' vol. 1 #1\\u20134 (June \\u2013September  1993) [http://www.marvunapp.com/Appendix/domino1.htm]</ref> He was killed by a rogue Scourge agent named [[Bloodstain (comics)|Bloodstain]] in \'\'[[U.S. Agent|U.S.Agent]],\'\' vol. 1 #4 (September  1993).<ref>{{cite web|url=http://www.marvunapp.com/Appendix/bloodstn.htm |title=Bloodstain (Scourge, US Agent foe) |publisher=Marvunapp.com |date=2001-09-02 |accessdate=2011-02-11}}</ref>\\n\\n==Other versions==\\n\\n===Age of Apocalypse===\\nIn the [[Age of Apocalypse]] reality, Domino was a sadistic bounty hunter working for [[Apocalypse (comics)|Apocalypse]], alongside her two henchmen, [[Caliban (comics)|Caliban]] and [[Grizzly (comics)|Grizzly]]. Domino was summoned by the Dark Lord to hunt down [[X-Man|Nate Grey]]. Even though Domino\'s powers gave her the advantage, she was killed by Nate, who destroyed her mind by exposing her to all the suffering she had caused.{{issue|date=January 2014}}\\n\\n===Earth X===\\nIn the Earth X storyline, an overweight Domino, still a member of X-Force, was one of the many people who was a pawn of the Skull.<ref>\'\'Earth\'\' X #2 (May 1999)</ref>\\n\\n===Skornn===\\nIn an alternate future, Domino took on the identity of Stryfe. Coming to Earth-616, she rebuilt the Mutant Liberation Front and assisted Cable against Skornn. Her Earth designation is Earth-5014.<ref>\'\'X-Force,\'\' vol. 2 #4 (January  2005)</ref>\\n\\n===Ultimate Marvel===\\nIn the [[Ultimate Marvel]] Universe, Domino was introduced in the second part of the \\"\'\'Cable\'\'\\" storyline, that can be found in \'\'[[Ultimate X-Men]]\'\' #76 (January  2007). Once again, Domino appears to be part of Cable\'s team and looks just like her original counterpart.{{issue|date=January 2014}}\\n\\n===X-Men: The End===\\nIn this alternate future of [[X-Men: The End]], Domino, Rictor and Feral are the only three survivors of a brutal attack directed against X-Force. They are ambushed by shapeshifting enemies and Domino\'s luck runs out when a Super Skrull posing as Wolverine drives blades through her chest.{{issue|date=January 2014}}\\n\\n==In other media==\\n\\n===Television===\\n* Domino appeared in a several quick cameos throughout the run of the \'\'[[X-Men (TV series)|X-Men]]\'\' animated series starting with the first episode \\"Night of the Sentinels.\\" She had a cameo in the episode \\"Slave Island\\", voiced by [[Jennifer Dale]].<ref>{{Cite episode\\n| title        = Slave Island\\n| url          = http://www.tv.com/x-men/slave-island-3/episode/56110/summary.html?tag=ep_guide;summary\\n| serieslink   = X-Men_(TV_series)\\n| series       = X-Men\\n| network      = FOX\\n| airdate      = 1993-02-13\\n| season       = 1\\n| number       = 7\\n}}</ref>\\n* Domino appeared in \'\'[[Wolverine and the X-Men (TV series)|Wolverine and the X-Men]]\'\', voiced by [[Gwendoline Yeo]]. She first appears in \\"Hindsight (Part 2)\\" as a member of the Brotherhood of Mutants. She also appears in Professor X\'s alternate future as a member of his X-Men. As her abilities are subtle in nature, more emphasis has been put on her marksmanship, reflected in otherwise impossible shots such as clearing a full table of billiard balls on the breaking shot.<ref>{{Cite episode\\n| title        = Hindsight, Part II\\n| url          = http://www.tv.com/wolverine-and-the-x-men/hindsight-part-2/episode/1227959/summary.html?tag=ep_guide;summary\\n| serieslink   = Wolverine and the X-Men (TV series)\\n| series      = Wolverine and the X-Men\\n| began        = 2009-01-23\\n| ended        = 2009-01-30\\n| season       = 1\\n| number       = 2\\n}}</ref>\\n\\n===Video games===\\n* Domino makes a cameo appearance in Deadpool\'s ending in \'\'[[Ultimate Marvel vs. Capcom 3]]\'\', celebrating Wade\'s victory over [[Galactus]].\\n\\n* Domino appears as a supporting character in the \'\'[[Deadpool (video game)|Deadpool]]\'\' video game. Her appearance in the game was unveiled at the Marvel Video Games panel of [[New York Comic Con]] 2012.<ref>[http://marvel.com/news/story/19561/deadpool_game_meet_domino Deadpool Game: Meet Domino @ Marvel.com]</ref> Gwendoline Yeo reprises her role from \'\'Wolverine and the X-Men\'\'.\\n\\n* Domino appears in \'\'[[Marvel Heroes (video game)|Marvel Heroes]]\'\'.\\n* Domino is a playable character in \'\'[[Marvel: Avengers Alliance]]\'\'.\\n\\n==References==\\n{{Reflist|2}}\\n\\n==External links==\\n* {{Marvelwiki|Domino_(Neena_Thurman)|Domino (Neena Thurman)}}\\n* [http://uncannyxmen.net/characters/domino UncannyXmen.Net Spotlight On Domino]\\n\\n{{X-Men}}\\n{{New Mutants}}\\n{{Deadpool}}\\n\\n{{DEFAULTSORT:Domino (Comics)}}\\n[[Category:Comics characters introduced in 1992]]\\n[[Category:Characters created by Fabian Nicieza]]\\n[[Category:Characters created by Rob Liefeld]]\\n[[Category:Fictional characters from Florida]]\\n[[Category:Fictional mercenaries]]\\n[[Category:Marvel Comics martial artists]]\\n[[Category:Marvel Comics mutants]]\\n[[Category:Marvel Comics superheroes]]\\n[[Category:Ultimate Marvel characters]]"}]}}}}'