b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"1983069":{"pageid":1983069,"ns":0,"title":"Doop (comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{Refimprove|date=August 2008}}\\n{{shortlead|date=December 2014}}\\n{{Superherobox| <!--Wikipedia:WikiProject Comics-->\\n|image = [[Image:Doop.png|250px]]\\n|caption=Doop. Art by [[Mike Allred]].\\n|comic_color=background:#ff8080\\n|character_name=Doop\\n|real_name=Doop\\n|publisher=[[Marvel Comics]]\\n|debut= \'\'[[X-Force]]\'\' volume 1 #116 (July 2001)\\n|creators=[[Peter Milligan]]<br>[[Mike Allred]]\\n|alliance_color=background:#ffc0c0\\n|alliances=[[X-Force]]<br/>[[X-Statix]]<br/>[[X-Mansion#Post X-Men: Schism|Jean Grey School]]\\n|aliases=\\n|powers=Flight<br>Accelerated [[healing factor]]<br>Superhuman strength and durability<br>Physical malleability<br>Ability to replicate physical objects<br>Extra-dimensional void within body that can store objects and people\\n|}}\\n\\n\'\'\'Doop\'\'\' is a [[fictional character]] in the [[Marvel Universe]], created by writer [[Peter Milligan]] and artist [[Mike Allred]]. He made his debut in \'\'[[X-Force]]\'\' vol. 1 #116. He is a green, floating spheroid creature of unknown origins who speaks in a \\"language\\" all his own (represented in text by a special [[font]]).\\n\\n==Publication history==\\n\'\'\'Doop\'\'\' first appeared in \'\'X-Force\'\' vol. 1 #116, and appeared in every issue until the end of the series, and then appeared in all issues of \'\'[[X-Statix]]\'\'. Doop also appeared alongside [[Wolverine (character)|Wolverine]] in a two-issue limited series.\\n\\n==Fictional character biography==\\nDoop was said to be the product of a [[Cold War]] era U.S. military experiment, becoming instrumental in the fall of the [[Soviet Union]].<ref name=\\"xstatix22\\">\'\'X-Statix #21\'\', 2004, Marvel Comics, writer Peter Milligan</ref>\\n\\nHe later served as the cameraman for the celebrity [[Mutant (Marvel Comics)|mutant]] superhero team [[X-Statix]] (formerly known as X-Force). He films a mission to [[North Africa]] which is later criticized by then-team leader [[Zeitgeist (comics)|Zeitgeist]]; he feels Doop should not be going for artistic shots. The next X-Force mission is to New York, where they are to rescue the boy band \\"Boyz R Us\\" from hostage takers. While in the briefing room, [[U-Go Girl]] asks Doop not to keep shooting her rear from a low angle. Doop replies in his language only the characters know, while inexplicably mouthing some of his recording equipment.\\n\\nThe building is attacked by a helicopter gunship, killing the hostages and many of the terrorists. Most of the team dies also, with the exception of Doop, U-Go Girl and [[Anarchist (comics)|Anarchist]]. Doop gets high-quality images of the two slaying the remaining killers.\\n\\nPlush Doop dolls are seen on sale at the X-Statix cafe, for five dollars apiece. One of these is vandalized by [[Wolverine (character)|Wolverine]].\\n\\nAt one point, Doop secretly videotapes the rookie X-Statix member [[El Guapo (comics)|El Guapo]] succumbing to the temptations of fame and having a threesome. The released video destroys El Guapo\'s relationship with his original girlfriend.\\n\\nA section of X-Force headquarters is set aside for Doop\'s family, who are never seen in panel. This part is talked about very little by the team. The team hides in this area when they believed themselves to be in supernatural danger.\\n\\n===Corkscrew===\\n\\nIn a training/audition session for X-Statix, one of the applicants, [[Corkscrew (comics)|Corkscrew]], needlessly kills an opponent. It is discussed that Doop would take care of matters. Despite the seriousness of an innocent man having just died, Doop makes a joke in his language, which greatly entertains the team members present.\\n\\nDoop is sent on a camping trip with Corkscrew. At the end he simply kills Corkscrew with an axe, but not before subjecting the mentally unstable mutant to psychological torture. Part of this is tricking the man into killing wild horses.<ref>\'\'X-Statix\'\' #1 (2002)</ref>\\n\\n===Brain power===\\n\\nIn one incident, Doop\'s brain explodes, and parts of it land all across the world. X-Statix and [[Avengers (comics)|Avengers]] fight each other to gain control of the brain pieces. Doop, running on a backup brain in his butt and now capable of human speech, joins in. He fights [[Thor (Marvel Comics)|Thor]] to a standstill, sucking in his hammer [[Mjolnir (comics)|Mjolnir]] and recreating multiple copies. [[Captain America]] states that Doop was an American-created super-weapon that was capable of destroying the entire planet. The Avengers, in the end, allow Doop back in to X-Statix custody, after they show courage and responsibility in facing the [[Asgard|Asgardian]] threat of the \\"Three Sisters.\\"\\n\\nHe is acquainted with [[Wolverine (character)|Wolverine]], and the two even teamed up in a two-issue miniseries.\\n\\nIt was revealed that at some indeterminate point in Doop\'s life, he had an affair with a beautiful married woman. Her husband hired a private investigator, [[Philip Marlowe|Chandler]], to spy on his errant wife. Chandler found himself falling in love with Doop. In the end, Doop ditched the woman to have an affair with the detective.<ref name=\\"mutantheart\\">\'\'I \\u2665 Marvel: My Mutant Heart\'\' #1, 2006, Marvel Comics, writer Peter Milligan</ref>\\n\\n===Doop and Daap===\\nAfter the incident with the Avengers, X-Statix has a farewell party, attended by fans and multiple superheroes. They are hired for one last mission, ridding a billionaire\'s mansion full of terrorists. Doop\'s teammate [[Anarchist (comics)|Anarchist]] notes that this resembles a mission in the past where all but two X-Force members die. Not only is the mansion full of gunmen, it is also surrounded by attack helicopters. The uniform of the gunmen are identical to the ones that the \'Boyz R Us\' hostage takers wore. During the mission, everyone, Doop included, apparently perishes. Doop is seen sprawled in a chair with a large stomach wound.\\n\\nHowever, the vacationing [[X-Men]] [[Havok (comics)|Havok]] and [[Polaris (comics)|Polaris]] encounter a Doop-like entity when it crashes to Earth from outer space. Polaris immediately identifies the creature as the same being she had previously seen in space  and called it \'\'\'Daap\'\'\'. Havok eventually blasts it to pieces but it begins to reform itself. Its amorphous jelly-like remains then fly off with both Polaris and the mutant-hating [[Leper Queen]]. The true identity of Daap and any connection it has with Doop is left unrevealed.<ref>\'\'All-New Official Handbook of the Marvel Universe\'\' #3</ref>\\n\\n===Return===\\nDoop returns in a story published in the \'\'Nation X\'\' anthology series, where he is brought onboard [[Utopia (comics)|Utopia]] as a private investigator. The story is revealed to be nothing more than a dream, and that Doop is later shown living with a beautiful woman elsewhere.<ref>\'\'Nation X\'\' #4</ref> The first issue of \'\'Wolverine and the X-Men\'\' lists Doop as an adjunct member of the teaching staff at the Jean Grey Institute for Higher Learning.<ref>\'\'Wolverine and the X-Men\'\' vol. 1 #1 (October 2011)</ref> He is eventually shown substituting for Kitty Pryde\'s \\"Introduction to Religion\\" class, though, under Doop, the course largely consists of watching films while Doop takes naps. The students are shown to be comically unable to decipher Doop\'s lesson plan.<ref>\'\'Wolverine and the X-Men\'\' vol. 1 #5 (2012)</ref> Teaching, however, is a cover for Doop\'s real position.  Wolverine alone knows that Doop is actually the secret protector of the school, spending most of his time gathering and acting upon information regarding possible threats to the students.<ref>\'\'Wolverine and the X-Men\'\' vol. 1 #17 (September 2012)</ref> He again protects the unwary students from a super-villain attack, post-graduation, using sonics.<ref>\'\'Wolverine and the X-Men\'\' vol. 1 #42 (April 2014)</ref>\\n\\nDoop makes a cameo in \'\'Young Avengers\'\' as the designated driver at the end of the Young Avengers\' party. He is seen waiting with his arms crossed on the jet\'s loading ramp as Transonic carries an asleep Pixie on board.<ref>\'\'Young Avengers\'\' #15 (January 2014)</ref>\\n\\nAfter semi-regular appearances in \'\'Wolverine and the X-Men\'\', Doop returned in April 2014 in his own 5-issue mini-series, \'\'All New Doop\'\', written by creator Peter Milligan,<ref>{{cite web|url=http://marvel.com/news/comics/2014/1/9/21730/all-new_marvel_now_qa_all-new_doop |title=All-New Marvel NOW! Q&A: All-New Doop &#124; News |publisher=Marvel.com |date= |accessdate=2014-06-25}}</ref> penciled by [[David Lafuente]], with covers by Mike Allred.\\n\\n==Powers and abilities ==\\nDoop\'s abilities displayed in the comics thus far have included superhuman strength and durability, flight, regeneration, physical malleability, a vaguely defined ability to manipulate time and/or space, and the ability to replicate physical objects by unknown means. In the \\"silent\\" issue of \'\'X-Force\'\', he accidentally sucked the entire team into his body or mind via a popped pimple. He entered himself by picking at the pimple, and rescued his teammates from their own subconscious minds. When they were restored to reality, none but Doop was aware of what had occurred, and only a fraction of a second had actually passed.\\n\\nDoop uses his mouth as a storage space for his camera equipment, among other items; it is unknown whether these items are simply stored inside his physical body or are actually transported to another dimension like the one to which his teammates were transported.\\n\\nIn the \\"Lacuna\\" storyline in \'\'X-Force\'\', [[Lacuna (comics)|Lacuna]]\'s ability to stop time does not affect Doop. Whatever his control over time or space may be, it is apparently not powerful enough for the team to use him for teleporting the group; they relied first on [[U-Go Girl]] and later on [[Venus Dee Milo]] for long-distance travel.\\n\\nIn the \\"X-Statix vs. [[Avengers (comics)|Avengers]]\\" storyline in \'\'X-Statix\'\', Doop\'s brain was removed from his body and forced to project energy blasts at his teammates (a power that he did not demonstrate previously or afterwards). The brain was accidentally smashed into fragments by [[Thor (Marvel Comics)|Thor]], but his second brain (located in his hindquarters) was temporarily installed in his head until the original brain could be reassembled, though it was stated that this second brain would only keep him alive for a short time. Later, when Thor struck Doop with his hammer, [[Mjolnir (Marvel Comics)|Mjolnir]], Doop absorbed the hammer into his body and fired Mjolnir and a number of duplicate hammers from his mouth at Thor.\\n\\nDoop has stretched his facial features and tongue on numerous occasions, and once plucked an eye from his head and then replaced it. He expanded his body into a cushion in the \'\'Wolverine/Doop\'\' miniseries. It is unknown if Doop possesses any other powers. On the one instance where he was forced to kill someone, he apparently used an ordinary axe, although the killing itself was not actually depicted on-panel. Some time later, when Doop thought that Wolverine was dangerously insane, he was prepared to attack the X-Man with a broken glass bottle.\\n\\n===Doopspeak===\\nIn 2001, several websites claimed to have deciphered Doopspeak, using a translator created by fan Chris Griswold.<ref>[http://web.archive.org/web/20060513085124/http://retroxpunk.homestead.com/files/translator.jpg Doop translation key]</ref>\\n\\nMarvel quickly responded. Series editor Axel Alonso, in an October 8, 2001 article by Eric J. Moreels on the X-Fan site (now Comixfan) which was previously part of Cinescape.com:\\n\\n{{cquote|It was brought to our attention only last week that some folks were popping over to Blambot.com to ostensibly decode the enigma of \'Doop Speak\'. Do not be fooled. Says [series writer] Peter Milligan, and I quote: \'Any such alphabet that purports to exist is to \'Doop Speak\' what a Greek Restaurant menu is to The Iliad. The complexities and nuances of Doop Speak \\u2014 understood only by an initiated few \\u2014 cannot be encompassed or delineated by any one image system.\' Folks should \'translate\' at their own risk.}}\\n\\nHowever, doopspeak was revealed in 2014, at the back of Essential X-men issue 57.<ref>Essential X-men issue 57</ref>\\n\\n==Merchandise==\\nA figure of Doop was included with the [[Marvel Legends]] Series VI [[Deadpool (comics)|Deadpool]] figure.<ref>[http://www.oafe.net/shocka/ml6_dp.php ML6: Deadpool review]</ref>\\n\\nA Marvel Mini-Bust of DOOP by Bowen Designs was released in October 2004, as part of Phase II, Bust # 88 and sculpted by Randy Bowen [http://www.bowendesigns.com/product/doop_mini-bust.aspx Bowen Designs Doop Mini Bust]\\n\\n===Fictional merchandise===\\nDoop merchandise is popular in the Marvel universe, particularly among children; Paco Perez was seen wearing a Doop t-shirt, while [[Molly Hayes]] is the known owner of both a stuffed Doop doll and Doop poster. [[Jean Grey]] has also been seen with a Doop keychain.\\n\\n==In other media==\\n\\n===Television===\\n* Doop makes a cameo appearance in the \'\'[[Ultimate Spider-Man (TV series)|Ultimate Spider-Man]]\'\' episode \\"Back In Black.\\" He is seen as part of a fantasy sequence that Peter Parker imagines.\\n\\n===Video Games===\\n* Doop is seen in the video game \'\'[[Marvel Heroes (video game)|Marvel Heroes]]\'\'.\\n\\n===Movies===\\n* Doop is Portrayed By Michael Saltzman in the X-Force Movie.\\n\\n==References==\\n{{Reflist}}\\n\\n==External links==\\n* [http://uncannyxmen.net/characters/doop UncannyXmen.net Character Profile on Doop]\\n\\n[[Category:Comics characters introduced in 2001]]\\n[[Category:Characters created by Peter Milligan]]\\n[[Category:Characters created by Mike Allred]]\\n[[Category:Fictional bisexual males]]\\n[[Category:LGBT superheroes]]\\n[[Category:Marvel Comics superheroes]]\\n[[Category:Marvel Comics characters with superhuman strength]]"}]}}}}'