b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"1732956":{"pageid":1732956,"ns":0,"title":"Joseph (comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{Superherobox| <!--Wikipedia:WikiProject Comics-->\\nimage=[[image:Joseph (Magneto\'s Clone).jpg|225px]]\\n|caption=Joseph, clone of \'\'Magneto\'\'\\n|comic_color=background:#ff8080\\n|character_name=Joseph\\n|real_name=Joseph\\n|species=[[Mutant (Marvel Comics)|Human Mutant]], clone\\n|publisher=[[Marvel Comics]]\\n|debut=\'\'Uncanny X-Men\'\' #327\\n|creators=[[Scott Lobdell]]<br>[[Roger Cruz]]<br>(based upon [[Magneto (comics)|Magneto]] by [[Stan Lee]] and [[Jack Kirby]])\\n|alliance_color=background:#ffc0c0\\n|alliances=[[X-Men]]<br/>[[Acolytes (comics)|Acolytes]]<br/>[[Brotherhood of Evil Mutants]]<ref>\'\'Magneto: Not a Hero\'\' #1-4</ref>\\n|aliases=[[Magneto (comics)|Magneto]]\\n|powers=Generation and manipulation of magnetic fields\\n|}}\\n\'\'\'Joseph\'\'\' is a [[Marvel Comics]] [[fictional character|character]] who was briefly a member of the [[X-Men]]. Created by writer [[Scott Lobdell]] and artist [[Roger Cruz]], he first appeared in \'\'[[Uncanny X-Men]]\'\' #327 (December 1995).\\n\\nJoseph is a [[Human cloning|clone]] of the X-Men\\u2019s nemesis [[Magneto (comics)|Magneto]], possessing his [[magnetism|magnetic]] powers, though he was originally intended to be an [[amnesia]]c Magneto. He had a brief courtship with [[Rogue (comics)|Rogue]] before dying in battle with the actual Magneto. Joseph is later revived by [[Astra (comics)#Astra (Brotherhood)|Astra]].\\n\\n==Fictional character biography==\\nJoseph was discovered near a South American orphanage run by a nun known as Sister Maria. After several run-ins with \\"The Colonel,\\" Joseph opted to leave the orphanage to protect the children. It was shortly after this that he encountered [[Rogue (comics)|Rogue]] and saved her from the first wave of [[Bastion (comics)|Bastion]]\'s \\"Operation Zero Tolerance\\". Rogue believed Joseph to be an amnesiac and mysteriously youthful Magneto. During this time, the [[X-Men]] first encountered the being known as [[Onslaught (comics)|Onslaught]]. Believing Magneto to be responsible, the [[Avengers (comics)|Avengers]] sought Joseph out. Out of guilt for what he believed were his past sins, Joseph joined the X-Men in their war against Onslaught.{{issue|date=April 2013}}\\n\\nIn an attempt to find out more about his past, Joseph encountered the [[Acolytes (comics)|Acolytes]] and their leader [[Exodus (comics)|Exodus]]. They too believed that Joseph was Magneto and begged him to lead them. Exodus turned on Joseph when he noticed that Joseph was not the Magneto he knew. Joseph took on the identity of Magneto in order to convince the Acolytes that he truly was Magneto and ordered them to abandon their current activities. Exodus disagreed, but obeyed because he believed he saw a glimmer of the old Magneto within Joseph. Joseph returned to the X-Men, satisfied that he no longer was Magneto.{{issue|date=April 2013}}\\n\\nShortly afterwards, Joseph dedicated himself to reconstructing the [[List of Marvel Comics alien races#Z|Z\'nox]] chamber to give Rogue some control over her powers. It was successful, to an extent, in that while standing under it, Rogue was unable to absorb the powers or psyche of another person. Immediately after this, Joseph and some of the X-Men were sent to the [[Shi\'ar|Shi\'ar Galaxy]] in order to fight [[Phalanx (comics)|The Phalanx]]. When they returned to Earth, they were captured. In captivity Joseph met the mutant [[Maggott]], who had been saved by Magneto years before and expressed his gratitude to the confused Joseph. Maggott discovered though that their captor [[Erik the Red (comics)|Erik the Red]] was the real Magneto in disguise. Feeling that he owed Magneto for saving him, he did not tell the X-Men that Joseph was not Magneto.{{issue|date=April 2013}}\\n\\nSeveral weeks later, the Israeli agent [[Sabra (comics)|Sabra]] appeared at the X-Mansion and wanted to kill \\"Magneto\\". Maggott revealed to her that Joseph wasn\'t Magneto, confirming Sabra\'s suspicions. Joseph left with Sabra to find out more about his past and Magneto\'s current whereabouts. He was kidnapped by [[Astra (comics)|Astra]], who told Joseph his true origin where she was his creator by cloning him from Magneto\'s DNA. Astra sent Joseph against Magneto, who had publicly revealed himself. These events came to be known as the \'\'Magneto War\'\'. During this \'\'Magneto War\'\', Joseph appeared to have sacrificed himself in order to repair the damage done by Magneto to Earth\'s electromagnetic field.<ref>\'\'X-Men\'\' vol. 2 #87</ref>\\n\\nHowever, Astra revived Joseph, and implanted a record of Magneto\'s old memories, causing him to think as the true master of magnetism once did. Joseph announces his comeback by murdering 40 anti-mutant campaigners while wearing Magneto\'s costume, leaving the real Magneto to take the blame. Joseph has also assembled his version of the [[Brotherhood of Mutants]] consisting of himself, Astra, and mutated versions of [[Blob (comics)|Blob]], [[Mastermind (Jason Wyngarde)|Mastermind]], [[Quicksilver (comics)|Quicksilver]], [[Scarlet Witch]], and [[Toad (comics)|Toad]]. It is soon revealed that the mutated versions of Blob, Mastermind, Quicksilver, Scarlet Witch, and Toad are clones created by Astra. All the clones were killed by Magneto. Joseph is defeated by Magneto and remanded to [[Asteroid M|Utopia]]\'s X-Brig.<ref>\'\'Magneto: Not a Hero\'\' #1-4</ref>\\n\\n==Powers and abilities==\\nAs a clone of Magneto, Joseph possesses the superhuman power to generate extremely powerful [[magnetic field]]s. He can employ these magnetic fields to manipulate ferrous metals and to produce a number of other effects. He has also been shown to generate [[electricity]] and [[electromagnetic radiation]]. Joseph is capable of personal levitation/flight at high speeds, and often produces a protective magnetic aura around his own body. The real Magneto has on rare occasions been able to produce a [[wormhole]] using magnetism, and to safely teleport himself and others by means of the wormhole, but Joseph has not demonstrated a similar ability. It was revealed that the circumstances of his creation mean that he lacks the mental barriers that the original Magneto has established over the years to prevent himself from over-using his powers, with the result that Joseph can manipulate more energy than Magneto at the cost of causing significant damage to himself if he pushes himself too far.\\n\\n==References==\\n{{reflist}}\\n\\n==External links==\\n* [http://marvel.wikia.com/Max_Eisenhardt_%28Joseph%29_%28Earth-616%29 Joseph] at Marvel Wiki\\n* [http://www.comicvine.com/joseph/4005-15063/ Joseph] at Comic Vine\\n* [http://uncannyxmen.net/characters/joseph UncannyXmen.Net Spotlight on Joseph]\\n\\n{{X-Men}}\\n\\n[[Category:Characters created by Scott Lobdell]]\\n[[Category:Comics characters introduced in 1995]]\\n[[Category:Marvel Comics superheroes]]\\n[[Category:Fictional clones]]\\n[[Category:Fictional genetically engineered characters]]\\n[[Category:Marvel Comics mutants]]\\n[[Category:Marvel Comics supervillains]]"}]}}}}'