b'{"warnings":{"query":{"*":"Formatting of continuation data will be changing soon. To continue using the current formatting, use the \'rawcontinue\' parameter. To begin using the new format, pass an empty string for \'continue\' in the initial query."}},"query":{"pages":{"15355925":{"pageid":15355925,"ns":0,"title":"Jubilee (comics)","revisions":[{"contentformat":"text/x-wiki","contentmodel":"wikitext","*":"{{For||Jubilee (disambiguation)}}\\n\\n{{Infobox comics character <!--Wikipedia:WikiProject Comics-->\\n|character_name=Jubilee\\n|image=Jubileedecimation.jpg\\n|converted=y\\n|caption=Jubilee<br>\'\'Decimation: Generation M\'\' #2 (February 2006).<br>Cover by [[Stuart Immonen]]\\n|real_name=Jubilation \\"Jubilee\\" Lee\\n|species=[[Vampire (Marvel Comics)|Vampire]] (formerly [[Mutant (Marvel Comics)|Human Mutant]])\\n|publisher=[[Marvel Comics]]\\n|debut=\'\'[[Uncanny X-Men]]\'\' #244 (May 1989)\\n|creators=[[Chris Claremont]]<br>[[Marc Silvestri]]\\n|alliances=Forgiven<ref>\'\'X-Men\'\' vol. 3 #27 (2012)</ref><br/>[[New Warriors]]<br/>[[X-Men]]<br/>[[X-Corps]]<br/>[[Generation X (comics)|Generation X]]<br/>[[X-Mansion|Xavier Institute]]\\n|aliases=Wondra\\n|powers= Possesses the powers and abilities of a vampire.<br>\'\'\'Formerly:\'\'\'<br>Ability to project pyrotechnic energy [[plasmoid]]s<br>Concussive blasts<br>Ability to evade the detection of telepaths<br>Ability to explosively charge objects.\\n|cat=super\\n|subcat=Marvel Comics\\n|hero=y\\n|sortkey=Jubilee (comics)\\n}}\\n\'\'\'Jubilee\'\'\' (\'\'\'Jubilation Lee\'\'\') is a [[fictional character]], a [[Marvel Comics]] [[superheroine]] associated with the [[X-Men]].\\n\\nA [[Mutant (Marvel Comics)|mutant]], Jubilee had the superhuman power to generate pyrotechnic energy [[plasmoid]]s out of her hands.  She is often illustrated wearing a yellow trench coat.  A teenage \\"[[shopping mall|mall]] rat,\\" she was the X-Men\'s youngest member in the early 1990s, often playing [[sidekick]] to [[Wolverine (character)|Wolverine]]. She eventually joined the junior team [[Generation X (comics)|Generation X]]. She was a prominent character in the 1990s-era [[X-Men (TV series)|\'\'X-Men\'\' animated series]]. In late 2004, Marvel launched a self-titled series for Jubilee set in Los Angeles, written by [[Robert Kirkman]] and covers by Casey Jones; it was canceled after six issues. She also has cameo appearances in all three X-Men films; she is portrayed by Katrina Florence in \'\'[[X-Men (film)|X-Men]]\'\' and by [[Kea Wong]] in \'\'[[X2: X-Men United]]\'\' and \'\'[[X-Men: The Last Stand]]\'\'.\\n\\nJubilee is one of the [[Decimation (comics)|depowered]] [[Mutant (Marvel Comics)|mutant]] characters who later reappeared using technology-based powers in the \'\'[[New Warriors]]\'\' comic series. She has since been turned into a vampire where she gained vampire-like powers.\\n\\n==Publication history==\\n{{Expand section|date=August 2010}}\\nJubilee was created by writer [[Chris Claremont]] and artist [[Marc Silvestri]] and first appeared in \'\'[[Uncanny X-Men]]\'\' #244 (May 1989).\\n\\n==Fictional character biography==\\n{{Plot|section|date=February 2015}}\\n\\nJubilation Lee is a Chinese American girl born in [[Beverly Hills, California|Beverly Hills]], [[California]], where she lived with her wealthy immigrant parents. An immensely talented [[gymnastics|gymnast]], she was believed to have the potential to participate in the [[Olympic Games]]. However, her life was destroyed when her parents were murdered by the [[Contract killing|hitmen]] Reno and Molokai.\\n\\nJubilee was sent to an [[orphanage]], but she ran away and hid in the Hollywood Mall, stealing food to survive. She first discovered her mutant power to generate blinding and explosive energy \\"fireworks\\" while running away from mall security. The stress of running away from the security guards caused Jubilee to emit a large light energy blast while in a back alley. This completely disoriented the men and allowed the frightened young girl to escape. Upon learning about her mutant ability to create fireworks, she realized she could earn money by using her powers to entertain customers in the mall.\\n\\nThe mall security attempts to put an end to her unauthorized performances, but she consistently eludes them. They hire the M-Squad, a company of professional mutant hunters, to capture her. Jubilee is rescued by [[X-Men]] members [[Dazzler]], [[Psylocke]], [[Rogue (comics)|Rogue]], and [[Storm (Marvel Comics)|Storm]]. Curious about the women, she tracks them to the portal leading back to their base in the [[Outback]] and steps through.<ref>\'\'Uncanny X-Men\'\' #244 (May 1989)</ref>\\n\\nJubilee stays in hiding in the base, as she has never heard of the X-Men and has no idea how they might react to her presence.<ref>\'\'Uncanny X-Men\'\' #247 (August 1989)</ref> She steals food and borrows clothes from several of the X-Men to create a makeshift costume for herself. She is attacked by a cybernetic dog, and forced to use her powers in self-defense by blowing up the beast. This is the first time Jubilee learns her powers can do real damage, although a later [[retcon]] has her first manifestation causing destruction on a similar scale.{{cn|date=July 2014}}\\n\\nWhile sneaking around the caverns in the outback base, Jubilee witnesses the X-Man [[Wolverine (character)|Wolverine]] being captured and tortured by the [[Reavers (comics)|Reavers]]. Jubilee is terrified of the Reavers, but unable to convince herself to abandon a fellow human being to such suffering. During a respite from the torture sessions, Jubilee helps Wolverine back to her hiding spot in the complex, where she does her best to nurse him back to health. Before Wolverine has completely recovered, he and Jubilee are forced to abandon their sanctuary when the Reavers hunt them down.<ref>\'\'Uncanny X-Men\'\' #251-252 (November 1989)</ref> The pair escape and make their way to [[Madripoor]]. They battle the [[Mandarin (comics)|Mandarin]] and [[Matsu\'o Tsurayaba]]\'s [[Hand (comics)|Hand]]. Jubilee holds her own against the Hand, and blows up a section of the Mandarin\'s castle with her powers when she, Wolverine, and Psylocke are his prisoners.<ref>\'\'Uncanny X-Men\'\' #257-268</ref>\\n\\nAfterward, Jubilee teams up with Wolverine on several of his missions throughout the world. She does not handle the travel well, as she desires American food and luxuries. She helps Wolverine in battle when he becomes involved with well-intentioned but violent mercenaries.\\n\\nAlongside Wolverine and Psylocke, Jubilee battles [[Harriers (comics)|Hardcase and the Harriers]].<ref>\'\'Uncanny X-Men\'\' #261</ref> She also meets the [[Black Widow (Natalia Romanova)|Black Widow]]<ref>\'\'Uncanny X-Men\'\' #268</ref> and participates in the mission to rescue several kidnapped [[New Mutants]] from [[Genosha]]. Against her protests, Wolverine places her in charge of looking after [[Tabitha Smith|Boom Boom]] and [[Rictor]] and meeting up with [[X-Factor (comics)|X-Factor]].<ref>\'\'Uncanny X-Men\'\' #271</ref> The three survive on the streets of the island nation before meeting up with the other X-Men.<ref>\'\'New Mutants\'\' #96-97, \'\'Uncanny X-Men\'\' #272</ref> After meeting the X-Men, she travels with them to the [[Shi\'ar]] Empire, but is captured by the [[Skrull|Warskrulls]]. There, she first meets [[Professor X]]avier.<ref>\'\'Uncanny X-Men\'\' #274-277</ref> She also briefly falls under the control of the [[Shadow King]], along with the X-Men and numerous others.<ref>\'\'X-Factor\'\' #69; \'\'Uncanny X-Men\'\' #280</ref>\\n\\n===Wolverine and the X-Men===\\nWolverine brings Jubilee to Professor Xavier, who welcomes the girl with open arms, and she and Wolverine develop a close father-daughter relationship with one another. Due to this relationship, Jubilee is referred to as Wolverine\'s unofficial sidekick.{{Verify source|date=March 2009}}\\n\\nJubilee finds a home with the X-Men, and joins the X-Men Blue Team. She aids her fellow mutants in battles against Omega Red, the Shi\'ar Empire, Skrulls, and the [[Brood (comics)|Brood]], among others. With the last three, she holds her own against many powerful entities, often being the vital factor that helps save fellow X-Men and/or innocent people. She forms close bonds with many of the team members. She catches piggyback rides with the [[Beast (comics)|Beast]], enjoying his leaping abilities. When Professor Xavier temporarily regains the use of his legs, she takes him rollerblading. She has the chance to talk about Wolverine with [[Kitty Pryde|Shadowcat]], who had been in her role before. She bonds with the younger version of [[Magik (comics)|Illyana Rasputin]]. Jubilee mourns the loss of Illyana with the rest of the X-Men, especially [[Jean Grey]].\\n\\nAlongside the X-Men, Jubilee is captured by [[Omega Red]], Matsu\'o Tsuryaba, and [[Fenris (comics)|Fenris]]. She also fights [[Sabretooth (comics)|Sabretooth]] during this encounter.<ref>\'\'X-Men\'\' Vol. 2 #5-7</ref> Alongside Wolverine, she then clashes with [[Mojo (comics)|Mojo]](see [[#Abcissa|Abcissa]]), and is arrested in Tokyo for speeding and driving without a license.<ref>\'\'Wolverine\'\' (vol.2) #52-53</ref> There she meets [[Yukio (comics)|Yukio]], and teams with her against [[Cylla Markham|Cylla]].<ref>\'\'Wolverine\'\' (vol.2) #55-57</ref> She aids the X-Men and [[Ghost Rider (Daniel Ketch)|Ghost Rider]] against the [[Brood (comics)|Brood]].<ref>\'\'X-Men\'\' Vol. 2 #8-9; \'\'Ghost Rider\'\' Vol. 2 #26-27</ref> Jubilee then journeys with the X-Men to Mojoworld.<ref>\'\'X-Men\'\' Vol. 2 #10-11</ref>\\n\\nDuring one adventure Jubilee falls halfway through a time portal and witnesses the moment when hitmen arrived at her home to kill her parents. Knowing the names and faces of her parents\' murderers for the first time, Jubilee sets out to kill them, but Wolverine talks her out of it.<ref>\'\'Wolverine\'\' (vol.2) #72-74</ref> Shortly after Wolverine leaves the X-Men. He does not give Jubilee the option to come with him, instead leaving her a note which repeatedly emphasizes that she should stick with Professor Xavier and not go out on her own again.<ref>\'\'Wolverine\'\' (vol.2) #75 (November 1993)</ref> Though she maintains her usual spunky demeanor in the ensuing weeks, the other X-Men notice that she feels somewhat abandoned by Wolverine\'s leaving.<ref>\'\'X-Men\'\' (vol. 2) #29 (February 1994)</ref>\\n\\n===Generation X===\\nJubilee joins a new group of teenage mutants known as [[Generation X (comics)|Generation X]]. The team is led by [[Banshee (comics)|Banshee]] and [[Emma Frost]], and is initially composed of Jubilee, [[Husk (comics)|Husk]], [[Synch (comics)|Synch]], [[M (comics)|M]], and [[Skin (Marvel Comics)|Skin]], with [[Chamber (comics)|Chamber]],<ref>\'\'Generation X\'\' #1</ref> [[Penance (X-Men)|Penance]],<ref>\'\'Generation X\'\' #3</ref> [[Mondo (comics)|Mondo]]<ref>\'\'Generation X\'\' \'95 Annual</ref> and [[Gaia (comics)|Gaia]]<ref>\'\'Generation X\'\' #45</ref> joining as the series progresses. The team also becomes a safe haven for three young wards during their adventures: [[Artie Maddicks]], [[Leech (comics)|Leech]],<ref>\'\'Generation X\'\' #6</ref> and temporarily [[Franklin Richards]].<ref>\'\'Generation X\'\' #20</ref>\\n\\nBoth Banshee and Emma Frost educate the teenagers in school subjects as well as combat and field skills (with occasional assistance from visiting instructors such as Wolverine<ref>\'\'Wolverine\'\' vol.2 #94</ref> and Beast<ref>\'\'Generation X\'\' #21</ref>). Jubilee and the other mutant teens hone their unique abilities and occasionally battle foes such as the [[Juggernaut (comics)|Juggernaut]], [[Omega Red]],<ref>\'\'Generation X\'\' #10-11</ref> and their archrival [[Emplate]]. Time after time, Jubilee uses her experience with the X-Men to help her teammates outsmart their enemies. On more than one occasion, Jubilee is solely responsible for the defeat of Emplate. She uses sarcasm when Emplate siphons her powers so that he will become enraged enough to not have control over them, causing him to blast himself with Jubilee\'s energy blasts.<ref>\'\'Generation X\'\' #13-14</ref> During the team\'s last encounter with Emplate, Jubilee blows up Proudstar Hall in order to defeat him. Her teammates survive the massive explosion because [[Iceman (comics)|Iceman]] covers them with an ice shield.<ref>\'\'Generation X\'\' #57</ref>\\n\\nDuring her stay at the [[Massachusetts Academy (comics)|Massachusetts Academy]], Jubilee is kidnapped and held hostage by [[Bastion (comics)|Bastion]] during [[Operation: Zero Tolerance]].<ref>\'\'Generation X\'\' #25</ref> She manages to resist his mental probes for a good amount of time, hiding valuable information about the X-Men. Jubilee stages an escape early on, knocking several armed soldiers unconscious with a large plasma volley. However, she is recaptured when she stops to give CPR to one of the guards she injured.<ref>\'\'Generation X\'\' #26</ref> She eventually escapes with the help of Bastion\'s assistant Daria. While wandering the desert after her getaway, she is attacked by a [[Prime Sentinel]] and holds her own by blasting his vision receptors. She is saved at the last minute by Wolverine, who reunites her with the X-Men. After discovering Bastion has planted a nano-explosive inside Cyclops, the X-Men return home, dropping Jubilee off at Massachusetts Academy on the way.<ref>\'\'Wolverine\'\' vol. 2 #117-118</ref>\\n\\nOne of the most important episodes of her stay with Generation X comes when she discovers the true killer of her parents, Hunter Brawn. She stages a solo operation, using all of her powers, skills, and abilities to track down Brawn. With the help of her friends and teammates, she manages to take him down. Enraged at how he has destroyed her family, her powers flare to a massive level. Instead of killing the man, she takes out her aggression by blowing up his warehouse, leaving him to be arrested by local authorities.{{Issue|date=April 2011}}\\n\\n===After Generation X===\\nAfter Generation X disbands, Jubilee moves to L.A. with former teammate Skin to pursue an acting career. She is cast in nothing but stereotypical Asian roles, and after her agent tries to seduce her, she blasts him with a powerful plasma blast.\\n\\nAround this time she is offered a position on Banshee\'s militaristic X-Corps team, alongside former teammates Husk and M. The three young women hesitantly join Banshee in order to keep an eye on him. During her run with the X-Corps, Jubilee holds off an uprising in Paris by blinding hostile enemies. Jubilee and Husk, with the help of Stacy X, also manage to take down the [[Blob (comics)|Blob]] and rescue Banshee from [[Mystique (comics)|Mystique]].\\n[[File:Jubileewondra.jpg|thumb|left|125px|Jubilee as Wondra. Art by Humberto Ramos.]]\\nAfter her time in the X-Corps, Jubilee returns to L.A. with Skin, but the two of them (along with [[Magma (comics)|Magma]] and other mutants) are kidnapped and crucified on the front lawn of the X-Mansion by the [[Church of Humanity (comics)|Church of Humanity]]. Jubilee, Magma, and the others recover from the attack thanks to [[Warren Worthington III|Angel]]\'s healing blood, but Skin isn\'t so fortunate. Jubilee becomes depressed due to the loss of her friend Skin, and reunites with her friend Husk. The two of them, along with Angel, attend Skin\'s funeral. Since the gravekeeper won\'t allow a mutant to be buried in his cemetery, he has Skin cremated and hands Jubilee the ashes. After that, Jubilee goes on a few missions with [[Nightcrawler (comics)|Nightcrawler]] and [[Havok (comics)|Havok]]\'s Uncanny X-Men team, but is taken off the active roster when [[Cyclops (comics)|Cyclops]] decides she needs a mental break.\\n\\nWhile inactive, Jubilee is contacted by a long lost relative, her aunt Hope. Hope has decided to adopt Jubilee and take her into her home in Los Angeles, which gives Jubilation a much-needed break from mansion life. Jubilee attends Payton Noble High School and becomes a peer advisor. She gets into a few fights in school, and is reprimanded because of her power display. She also befriends a mutant named Shane Shooter, and helps him take down a gang leader. Unfortunately for Jubilee, her aunt is caught in a crime ring, as she was an assassin. While Wolverine is visiting Jubilee, the two of them \\u2014 along with Hope (and her butler Brad) \\u2014 get into a battle with Hope\'s former boss. Hope is caught in a violent explosion and seemingly dies (she is later revealed to have been thrown afar by the explosion, revealing her cybernetic nature), causing a distraught Jubilee to move back to the mansion with Wolverine where she is seen celebrating Christmas in \'\'X-Men\'\', Volume 2, #165.\\n\\n===Decimation and aftermath===\\nJubilee is revealed to have lost her \\"powers\\" on [[Decimation (comics)|M-Day]]<ref>\'\'Decimation: The Day After\'\' One-Shot</ref> due to the reality-altering powers of the [[Scarlet Witch]]. She returns to New York shortly after \\"running\\" a half-way house for depowered mutants in Queens, NY<ref>\'\'Wolverine: Origins\'\' #6</ref> and is kidnapped by [[Omega Red]] and his henchmen while Wolverine is sidetracked during the battle and taken to Berlin as a hostage. Wolverine manages to use [[S.H.I.E.L.D.]] to find Jubilee, but she is beaten and injured badly. Logan trades his freedom from S.H.I.E.L.D. for Jubilee\'s safety and well-being. She is carried away in a medical unit by S.H.I.E.L.D. operatives.<ref>\'\'Wolverine: Origins\'\' #10</ref>\\n\\nJubilee next resurfaces as Wondra,<ref>\'\'New Warriors\'\' vol. 4 #1</ref> the second in command of the latest incarnation of the [[New Warriors]]. She uses technologically based super strength (supplied by what appears to be a variation of [[Wizard (Marvel Comics)|The Wizard\'s]] \\"Wonder Gauntlets\\") capable of lifting a locomotive engine over her head.<ref>\'\'New Warriors\'\' (vol. 4) #2</ref> Recruited as the first member, Jubilee takes a more serious attitude to her role as Wondra and serves alongside former teammates and X-Men Chamber (\\"Decibel\\"), Stacy X (\\"[[Stacy X|Ripcord]])\\", and Sofia Mantega (\\"[[Wind Dancer|Renascence]]\\"). Jubilee distrusts Night Thrasher and uncovers evidence that he is using the team for less than noble reasons, and after a trip to the future, the former mutants leave the team in the hands of ex-members of the Initiative ([[Slapstick (comics)|Slapstick]], [[Vance Astrovik|Justice]], [[Ultra Girl]], et al.).\\n\\nAfter leaving the New Warriors, she returns to San Francisco and meets with a group of young mutants her age, who tell her about [[Asteroid_M#Fifth_version.2FUtopia|Utopia]], the island home for mutants. Jubilee reaffirms her identity as a mutant, despite being depowered, but still declines to join the X-Men on Utopia.<ref>\'\'X-Men: Nation X\'\' #2</ref>\\n\\n===Curse of the Mutants===\\nCyclops sends Pixie to check on her, and while the girls are chatting, Jubilee is one of many individuals to be mass infected with a bio-engineered virus by a vampire suicide bomber. Jubilee is taken to the X-Men\'s headquarters, where they run tests on her, confirming that the virus is slowly but surely transforming her into a vampire, making her less and less able to handle sunlight. Meanwhile, others infected by the virus quickly turn into full vampires and begin enacting the plans of the mysterious \\"Lord of Vampires.\\"<ref>\'\'X-Men\'\' Vol. 3, #1</ref>\\n\\nLater while talking to [[Doctor Nemesis]], Jubilee reveals that something is calling for her, to which Doctor Nemesis tells her to fight it back. Jubilee eventually tells him that she doesn\'t want to fight. Much later while the X-Men gather to discuss the death of Dracula and learn who the new Lord of Vampires is, [[Kavita Rao|Dr. Kavita Rao]] is seen checking on her only to be attacked.\\n\\nJubilee leaves Utopia to go see [[Xarus]], who bites her. It\'s also revealed that Xarus only wants Jubilee so the X-Men can come to rescue her and fall into a trap, especially Wolverine.<ref>\'\'X-Men\'\' Vol. 3, #2</ref>\\n\\nIt appears that Jubilee has been successfully transformed into a vampire and temporarily did the same to Wolverine after he came to rescue her.<ref>\'\'X-Men\'\' Vol. 3, #3</ref> She remains a vampire and was being detained in a holding cell beneath Utopia for observation.<ref>\'\'X-Men\'\' Vol. 3, #6</ref>\\n\\n===Touching Darkness===\\nAt Gambit\'s behest, Wolverine travels to Paris, taking Jubilee with him. There, tensions between her and [[X-23]] (who is traveling with Gambit) flare up. Meanwhile, Gambit talks to Wolverine about the difference between how he treats Jubilee and X-23, who both see him as a father figure.<ref>\'\'X-23\'\' Vol. 3, #10</ref> Jubilee soon starts to develop a friendship with X-23 due to their similar circumstances, with the latter helping her deal with her urges to kill while Jubilee in turn helps Laura learn how to be a normal girl.<ref>\'\'X-23\'\' Vol. 3, #11</ref> She is later taken in by a group of vampires called The Forgiven, who have learned to move beyond their need for blood and can move about in the day, as a student.\\n\\n===Marvel Now===\\nJubilee returns to the X-Men with an orphaned baby, who she names Shogo, who was infected with [[Arkea]].<ref>The X-Men Vol. 4, #1</ref> During the [[Battle of the Atom]] event Sentinel X, a member of the future X-Men, is revealed to be a now fully grown Shogo and the two spend a bit of quality time together after the death of the future version of Jubilee and the defeat of the Brotherhood. Afterwards Storm informs her that the adoption papers have gone through and that Jubilee is now legally Shogo\'s mother.<ref>\'\'X-Men\'\' Vol. 4, #7</ref>\\n\\n==Powers and abilities==\\nDue to the character\'s history, Jubilee has had a diverse range of powers as a mutant, a depowered human, and later as a vampire.\\n\\n===Former Mutant powers===\\nJubilee had the [[Mutant (Marvel Comics)|mutant]] power to generate bright bursts of multi-colored energy [[plasmoid]]s from her fingertips. She referred to these globules as \\"fireworks\\". The globules obeyed her mental control, traveling where she directed them, arranging themselves in balls, streamers, and other shapes, and exploding when she wished. The strength of the energy varies in degrees of power and intensity, and could range from a multitude of colorful sparkles capable of temporarily blinding a person to a powerful detonation capable of smashing objects and destroying property, or a precision burst inside a human brain, simulating the effects of a massive stroke. Jubilee could absorb the fireworks back into her own body without harm. Jubilee often referred to her powers as \\"pafs.\\" \\"Paf\\" appears in many instances as [[onomatopoeia]] for her powers.\\n\\nWhile training in Generation X, Emma Frost described Jubilee as having the untapped potential to detonate matter at a sub-atomic level, which in theory is the equivalent of a [[Nuclear weapon design#Fusion|fusion bomb]]. Her moral stance on taking a life was observed by Emma during the \\"[[Phalanx Covenant]]\\" when Jubilee explained her fear of killing someone should her powers ever flare up again as they did during the \\"[[Acts of Vengeance]]\\" storyline in \'\'[[Uncanny X-Men]]\'\' where she destroyed an entire house during a panicked moment. Emma Frost stated that Jubilee had unlimited potential and was one of the most powerful mutants she had ever encountered. Her [[Age of Apocalypse]] alternate had minimal qualms in this regard, and made liberal use of her full powers. \\n\\nIn her early appearances, Jubilee also displayed an apparent immunity to telepathy, but this was soon abandoned by writers. She had on occasion used this ability to hide herself from telepathic scans and probes from Sentinels. Whether or not she knew of this ability remains unaddressed.\\n\\n===As Wondra===\\nJubilee was among the mutants depowered by M-Day. She fell into a deep depression following the loss of her powers, going through several jobs before joining the latest incarnation of the New Warriors as Wondra.\\n\\nUpon joining the post-\'\'[[Civil War (comics)|Civil War]]\'\' New Warriors team, Jubilee gained highly advanced technology from Night Thrasher to replace her mutant abilities, giving her superhuman strength. While the upper limits of this power were not explored, the technology allowed Jubilee to lift the engine of a freight train over her head. Wondra\'s power suit and gauntlets also enhance her with limited invulnerability, as well as the ability to fly with hover discs.\\n\\n===Vampire abilities===\\nJubilee has since gained the powers of a vampire from her transformation by the bite of Xarus, son of Dracula. Her powers include superhuman strength and speed, and the ability to turn into vapor. It is possible that she can heal much faster than a human.\\n\\nAs a vampire, Jubilee now possesses all of the weaknesses of a vampire. She must sustain herself on blood and avoid direct sunlight, garlic, silver, and religious symbols.\\n\\n===Innate traits and abilities===\\nJubilee is a talented gymnast and in-line skater. While living on her own, she used her skills to evade capture while stealing to survive, first from the various shops in the mall and later in the X-Men\'s Australian base. She has also displayed above average hand-to-hand combat skills, having learned street-fighting techniques while in Los Angeles County Juvenile Hall, and being coached further by Wolverine. Her skills are sufficient enough to survive combat with the [[Hand (comics)|Hand]]. She also demonstrated strong leadership abilities, often being placed in a field commander role by Banshee during her closing time with Generation X, and acting as a drill-sergeant figure for the most recent New Warriors team.\\n\\nIn one issue of Wolverine\'s comic, it was stated that Jubilee suffers from [[dyscalculia]].<ref>\'\'Wolverine\'\' vol. 2 #62 (October 1992)</ref>\\n\\n==Other versions==\\n\\n===Abcissa===\\nIn one [[alternate history|alternate timeline]], Mojo tried to stop the [[Big Crunch]], the end of time and collapse of all matter which would start a new [[Big Bang]]. Jubilee told him to stop, and she would be his slave. Giving her the new name \'\'\'Abcissa\'\'\', her powers would be altered to animate and control the many chains that were attached to her body. Abcissa and Mojo kidnapped Jubilee, taking her to the Crunch, so she would become Mojo\'s slave. Jubilee refused, which nullified Abcissa\'s existence. Wolverine arrived and defeated Mojo.{{issue|date=April 2013}}<ref>[http://www.marvunapp.com/Appendix/abscissa.htm Abcissa] at the Appendix to the Handbook of the Marvel Universe</ref>\\n\\n===Age of Apocalypse===\\nIn the [[Age of Apocalypse]], Jubilee is part of [[Gambit (comics)|Gambit]]\'s [[Age of Apocalypse#Gambit and the X-Ternals|X-Ternals]], a group of rebel thieves. She went with the X-Ternals to the [[Shi\'ar|Shi\'ar Empire]] in order to steal a piece of the [[M\'Kraan Crystal]]. Jubilee also displayed a greater level of control over her power than her Marvel-616 version by detonating the clothing of several Madri enforcers on a molecular level. In addition, she uses the full extent of her powers by destroying a Shi\'ar ship single-handedly.<ref>\'\'Gambit and the X-Ternals\'\' #1</ref>  Her fate in the tenth anniversary issue of the Age of Apocalypse is not revealed.\\n\\n===Amalgam Comics===\\nIn this alternate universe, where part of the Marvel multiverse is fused with part of the DC multiverse, Jubilee is combined with Robin to become \'\'\'Sparrow,\'\'\' sidekick of \'\'\'[[Dark Claw]]\'\'\' (Wolverine + [[Batman]]).{{cn|date=April 2013}}\\n\\n===Days of Future Past===\\nIn [[Days of Future Past]], Jubilee is one of the last X-Men alive and among the few mutants who are not prisoners in a concentration camp. She lives together with her lover [[Synch (comics)|Synch]] in the ruins of [[Hollywood, Los Angeles, California|Hollywood]].<ref>X-Men: Days of Future Past: Wolverine</ref>\\n\\n===DC vs. Marvel===\\nIn the Marvel/DC crossover series \\"[[DC vs. Marvel]]\\" storyline, Jubilee first met [[Tim Drake|Robin]] when he suddenly appeared in her room. She starts admiring his costume and eventually develops an attraction to him. The two were later transported to a warehouse and before they begin their fight, Jubilee kissed Robin. While Jubilee had the upper hand, Robin used a sneak attack and won without hitting her. Robin and Jubilee suddenly ended up in [[Venice]], and while they didn\'t know how they ended up there, neither cared, and soon they started a relationship. With the universe restored and the heroes and villains returned to their respective universe, Jubilee became upset that she would no longer see Robin again. However, she was later briefly reunited with him in the follow-up \'\'Age of Amalgam\'\' Marvel/DC crossover series.\\n\\n===MC2===\\nIn [[Marvel Comics 2|MC2]], Jubilee is the leader of a team of mutant heroes called the [[X-People]]. She was also part of [[A-Next]], a future generation of Avengers. However, Jubilee prefers to act on her own and only reluctantly cooperates with other heroes. She apparently still retains a reserve status with the Avengers, and has joined them on several occasions. She can sporadically be seen in the [[Spider-Girl]] series and related miniseries.{{issue|date=April 2013}}\\n\\n===Mutant X===\\nIn [[Mutant X (comics)|Mutant X]], Jubilee is the leader of the villain team the Marauders, consisting of [[Sunspot (comics)|Sunspot]], [[Wolfsbane (comics)|Wolfsbane]], [[Cannonball (comics)|Cannonball]], [[Husk (comics)|Husk]], although she has trouble keeping her team under control. After the Marauders had a fight with [[Alternative versions of Storm#Mutant X|Bloodstorm]], Jubilee was severely hurt.{{issue|date=April 2013}}\\n\\n===Team X===\\nTeam X was a brief one-shot featuring [[Bishop (comics)|Bishop]] and [[Deathbird]]. It features a green-bodysuit Jubilee (code-named Vertigo) from about fifteen years into the future. Vertigo was a part of a resistance movement against Shi\'ar Majestrix Alanna, the maniacal daughter of [[Lilandra Neramani|Lilandra]] and [[Professor X]]. This version of Jubilee possesses several light-based powers including making light knives, firing photon beams, and turning invisible.{{issue|date=April 2013}}\\n\\n===Ultimate Jubilee===\\nJubilee is a member of [[Alpha Flight#Ultimate Marvel|Alpha Flight]], first appearing in \'\'[[Ultimate X-Men]]\'\' #94. The team overpowers the X-Men during their game of [[baseball]] against the [[New Mutants#Other versions|Academy of Tomorrow]] and kidnaps [[Northstar#Ultimate Northstar|Northstar]], claiming that he belongs with them. Her powers and appearance seem not to differ greatly from her Earth-616 counterpart, as well as her laid back personality during and after the battle. She is a fan of [[Dazzler#Ultimate Dazzler|Dazzler]]. She is such a fan that she planned to get Dazzler\'s autograph and wore one of her band\'s shirts when they attacked, much to the annoyance of her team, especially [[Snowbird (comics)#Ultimate Snowbird|Snowbird]].<ref>\'\'Ultimate X-Men\'\' #94-95</ref>\\n\\n==In other media==\\n===Television===<!-- This section is linked from [[X-Men (TV series)]] -->\\n[[Image:Jubileeanimated.jpg|thumb|left|Jubilee starred in the \'\'[[X-Men (TV series)|X-Men]]\'\' animated series.]]\\n*In the 1992 [[X-Men (TV series)|\'\'X-Men\'\']] [[List of animated television series|animated television series]], Jubilee was voiced by [[Alyson Court]]. Jubilee was a main character of the original animated series, where she basically had the role [[Kitty Pryde]] had in the original comics, in her being the younger sister character. Her background story was also adapted to being similar to Kitty Pryde\'s with [[Cyclops]] retrieving her from her foster parents\' home, rather than her fending for herself and being homeless, like she was in the comics. She appeared in almost all of the episodes throughout the many seasons it aired. She was close to many X-Men, including [[Gambit (comics)|Gambit]], as he helped to save her from the Sentinels in the pilot \\"Night of the Sentinels\\". She also had a very close relationship with [[Wolverine (character)|Wolverine]] who was still shown to dote on her in his own gruff way; in one episode, Logan was even shown teaching Jubilee how to drive. In the final episodes of the series, her appearance was redesigned without explanation to her Generation X look.<ref>\'\'X-Men\'\' Episode 71 \\"The Fifth Horseman\\", Episode 76 \\"Graduation Day\\"</ref>\\n\\n*She also guest starred in \'\'[[Spider-Man (1994 TV series)|Spider-Man: The Animated Series]]\'\' in the 1990s in the fourth and fifth episodes of Season 2, along with the rest of the X-Men.\\n\\n*In the 1996 television film \'\'[[Generation X (film)|Generation X]]\'\', the character was portrayed by Caucasian actress [[Heather McComb]], generating some controversy{{fact|date=December 2014}}. Jubilee had several power scenes and was one of the main characters.\\n\\n*In the 2001 \'\'[[X-Men: Evolution]]\'\' animated television series, she appeared infrequently as one of the [[New Mutants#Appearances in other media|New Mutants]], and was voiced by [[Chiara Zanni]]. As a nod to the original character, this incarnation of Jubilee always wore a yellow jacket when out of uniform. Her role was minimal in this series, not participating in any actual fighting in the show, and lacking any connection with Wolverine like she had in other incarnations of her character. She was written out of the show at the start of the third season, along with [[Wolfsbane (comics)|Wolfsbane]]. She appears one final time in the series finale, in Xavier\'s glimpse into the future, revealing that she does return to the team. Unlike her other depictions, this version of Jubilee was not an orphan. Also, it\'s been implied that she has feelings for [[Iceman (comics)|Iceman]].\\n\\n* Jubilee is mentioned in the [[Toei Animation|Toei]] [[anime]] series \'\'[[Marvel Disk Wars: The Avengers (TV Series)|Marvel Disk Wars: The Avengers]]\'\'\\n\\n===Films===\\n* Jubilee has [[cameo appearance]]s in three X-Men films, portrayed by Katrina Florece in \'\'[[X-Men (film)|X-Men]]\'\' and by [[Kea Wong]] in \'\'[[X2 (film)|X2: X-Men United]]\'\' and \'\'[[X-Men: The Last Stand]]\'\'. In the first film, Jubilee appears only as an [[Extra (acting)|extra]] in [[Professor X|Professor Xavier\'s]] and [[Storm (Marvel Comics)|Storm\'s]] classrooms. However, she is identified by name in a deleted scene, in which she talks to [[Kitty Pryde]] and [[Rogue (comics)|Rogue]]. In \'\'X2\'\', Jubilee appears in a deleted version of the museum scene which gives a brief introduction to her powers as blue electricity crackles around her fingers. Jubilee is among the six kidnapped young mutants that Storm and [[Nightcrawler (comics)|Nightcrawler]] rescue. She can be heard calling Storm\'s name and is shown running to safety with the X-Men and can be seen in the X-Jet. She also appears in the final classroom scene and briefly talks to Professor Xavier. She appears within the first ten minutes of \'\'X-Men: The Last Stand\'\', and can be seen sitting in the classroom.\\n\\n* In the [[novelization]] of \'\'X2,\'\' Jubilee has a more substantial role than in the film. During the raid on the mansion by General Stryker and his troops, Jubilee absorbs the electricity from a [[taser]] and blasts an enemy troop through a wall before being shot with [[tranquilizer dart]]s. She also is a sort of mentor to the other captured X-Kids, rallying their morale and telling them that the X-Men will come to their rescue.\\n\\n* Concept art of \'\'[[X-Men: Days of Future Past]]\'\' reveals Jubilee was considered to be featured in the movie. The concept art was based off actress [[Jamie Chung]]\'s likeness.<ref>{{cite web|url=http://screenrant.com/x-men-days-future-past-concept-art-jubilee |title=X-Men: Days of Future Past Concept Art Reveals Future Jubilee & Juggernaut|author=Shaw-Williams, Hannah |date=June 18, 2014 |accessdate=June 22, 2014}}</ref>\\n\\n===Video games===\\nJubilee appears in some of the \'\'X-Men\'\' [[video game]]s:\\n\\n[[Image:Jubilee.gif|thumb|right|Jubilee as she appears in \'\'[[Marvel vs. Capcom: Clash of Super Heroes|Marvel vs. Capcom]]\'\']]\\n* Jubilee appears in \'\'[[Marvel vs. Capcom: Clash of Super Heroes|Marvel vs. Capcom]]\'\' voiced by [[Alyson Court]]. She is a selectable helper character in which she throws several fireworks at her enemies.\\n\\n* She is also a cameo helper character in \'\'[[Wolverine (video game)|Wolverine]]\'\' for the [[Nintendo Entertainment System|NES]], in which she gives Wolverine a device to breathe underwater for a longer period of time.\\n\\n* Jubilee appears as a [[player character|playable character]] in the video game \'\'[[X-Men Legends]]\'\', voiced by [[Danica McKellar]]. In \'\'X-Men Legends\'\', Jubilee is unlocked early on in the game by talking to her at the X-Mansion.\\n\\n==Jubilee (Bratpack)==\\nAn earlier character named \'\'\'Jubilee\'\'\' first appeared in \'\'Longshot\'\' #4 in 1985. This character was a Caucasian female with strawberry blond hair created by writer [[Ann Nocenti]] and artist [[Arthur Adams (comics)|Art Adams]]. She is first introduced as a young girl named Darla and she and her friends, a gang called the Bratpack, meet [[Longshot]] when he first escapes to Earth. She develops a childhood crush on Longshot. They are later captured by [[Spiral (comics)|Spiral]] and given powers by [[Mojo (comics)|Mojo]] in \'\'New Mutants Annual\'\' #2 as part of a new team of captured and artificially aged fighters also called the \\"Bratpack\\". Darla was given the ability to produce pyrotechnic displays or fireworks, and was called \\"Jubilee\\" because, as she stated, \\"Every day was a celebration.\\" Under the influence of the similarly brainwashed Psylocke\'s psychic powers, Darla and her teammates were then sent to stop the New Mutants from rescuing the X-Men who had been regressed in age and turned into the X-Babies. Everyone is freed and returned to normal when [[Cypher (comics)|Cypher]] frees Psylocke from Mojo\'s control.\\n\\n==See also==\\n* [[List of Marvel Comics characters]]\\n\\n==References==\\n{{Reflist|2}}\\n\\n==External links==\\n* [http://www.comicbookdb.com/character.php?ID=17 Jubilee] at the Comic Book DB\\n* [http://www.uncannyxmen.net/db/spotlight/showquestion.asp?faq=10&fldAuto=99 Jubilee] at UncannyXmen.net\\n* [http://marvel.com/universe/Jubilee Jubilee] at Marvel Universe\\n* {{IMDb character|0001113|Jubilee}}\\n* [http://uncannyxmen.net/characters/jubilee-ii UncannyX-Men.net Spotlight On Jubilee]\\n\\n{{X-Men}}\\n{{Ultimate X-Men}}\\n\\n{{DEFAULTSORT:Jubilee (Comics)}}\\n[[Category:Characters created by Chris Claremont]]\\n[[Category:Characters created by Marc Silvestri]]\\n[[Category:Child superheroes]]<!-- The legal definition of \\"child\\" refers to a minor. The United Nations Convention on the Rights of the Child defines a child as \\"a human being below the age of 18 years.\\" -->\\n[[Category:Comic book sidekicks]]\\n[[Category:Comics characters introduced in 1989]]\\n[[Category:Fictional American people of Chinese descent]]\\n[[Category:Fictional characters from California]]\\n[[Category:Fictional orphans]]\\n[[Category:Film characters]]\\n[[Category:Marvel Comics characters with superhuman strength]]\\n[[Category:Marvel Comics mutants]]\\n[[Category:Marvel Comics vampires]]"}]}}}}'